RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_ll_system.h
/**
  ******************************************************************************
  * @file    stm32h7rsxx_ll_system.h
  * @author  MCD Application Team
  * @brief   Header file of SYSTEM LL module.
  *
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2022 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  @verbatim
  ==============================================================================
                     ##### How to use this driver #####
  ==============================================================================
    [..]
    The LL SYSTEM driver contains a set of generic APIs that can be
    used by user:
      (+) Some of the FLASH features need to be handled in the SYSTEM file.
      (+) Access to DBGCMU registers
      (+) Access to SBS registers
      (+) Access to VREFBUF registers

  @endverbatim
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef STM32H7RSxx_LL_SYSTEM_H
#define STM32H7RSxx_LL_SYSTEM_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32h7rsxx.h"

/** @addtogroup STM32H7RSxx_LL_Driver
  * @{
  */

#if defined (FLASH) || defined (SBS) || defined (DBGMCU) || defined (VREFBUF)

/** @defgroup SYSTEM_LL SYSTEM
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private constants ---------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Private_Constants SYSTEM Private Constants
  * @{
  */
#define LL_SBS_REGISTER_PINPOS_SHFT   16U                                 /*!< Define used to shift pin position in EXTICR register */
#define LL_SBS_HDPL_INCREMENT_VALUE   0x6AU                               /*!< Define used for the HDPL increment */
#define LL_SBS_DBG_UNLOCK             (0xB4U << SBS_DBGCR_DBG_UNLOCK_Pos) /*!< Define used to unlock debug */
#define LL_SBS_ACCESS_PORT_UNLOCK     0xB4U                               /*!< Define used to unlock access port */
#define LL_SBS_DBG_CONFIG_LOCK        0xC3U                               /*!< Define used to lock debug configuration */
#define LL_SBS_DBG_CONFIG_UNLOCK      0xB4U                               /*!< Define used to unlock debug configuration */
/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Exported_Constants SYSTEM Exported Constants
  * @{
  */

/** @defgroup SYSTEM_LL_EC_SBS_HDPL SBS hide protection level
  * @{
  */
#define LL_SBS_HDPL0                  0xB4U /*!< Hide protection level 0 */
#define LL_SBS_HDPL1                  0x51U /*!< Hide protection level 1 */
#define LL_SBS_HDPL2                  0x8AU /*!< Hide protection level 2 */
#define LL_SBS_HDPL3                  0x6FU /*!< Hide protection level 3 */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_SBS_AXISRAM_WS SBS AXISRAM wait state number (when ECC=0)
  * @{
  */
#define LL_SBS_AXISRAM_NO_WS          0U                    /*!< No wait state added when accessing AXISRAM */
#define LL_SBS_AXISRAM_ONE_WS         SBS_PMCR_AXISRAM_WS   /*!< One wait state added when accessing AXISRAM */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_SBS_ETH_PHYSEL SBS Ethernet PHY interface selection
  * @{
  */
#define LL_SBS_ETH_PHYSEL_GMII_MII    0U                    /*!< GMII or MII interface */
#define LL_SBS_ETH_PHYSEL_RMII        SBS_PMCR_ETH_PHYSEL_2 /*!< RMII interface */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_SBS_BOOSTVDDSEL SBS Booster Vdd selection
  * @{
  */
#define LL_SBS_BOOSTVDDSEL_VDDA       0U                   /*!< Vdda selected as analog switch booster voltage supply */
#define LL_SBS_BOOSTVDDSEL_VDD        SBS_PMCR_BOOSTVDDSEL /*!< Vdd selected as analog switch booster voltage supply */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_SBS_XSPI2_COMP_CODESEL SBS XSPI2 compensation cell code selection
  * @{
  */
#define LL_SBS_XSPI2_CODE_CELL        0U                           /*!< Code applied to compensation cell from cell */
#define LL_SBS_XSPI2_CODE_REG         SBS_CCCSR_XSPI2_COMP_CODESEL /*!< Code applied to compensation cell from register */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_SBS_XSPI1_COMP_CODESEL SBS XSPI1 compensation cell code selection
  * @{
  */
#define LL_SBS_XSPI1_CODE_CELL        0U                           /*!< Code applied to compensation cell from cell */
#define LL_SBS_XSPI1_CODE_REG         SBS_CCCSR_XSPI1_COMP_CODESEL /*!< Code applied to compensation cell from register */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_SBS_COMP_CODESEL SBS I/O compensation cell code selection
  * @{
  */
#define LL_SBS_IO_CODE_CELL           0U                     /*!< Code applied to compensation cell from cell */
#define LL_SBS_IO_CODE_REG            SBS_CCCSR_COMP_CODESEL /*!< Code applied to compensation cell from register */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_SBS_TIMBREAK SBS break lockup input timer peripherals
  * @{
  */
#define LL_SBS_TIMBREAK_PVD           SBS_BKLOCKR_PVD_BL      /*!< Connect the PVD output with TIM1/15/16/17 break input                                 */
#define LL_SBS_TIMBREAK_FLASHECC      SBS_BKLOCKR_FLASHECC_BL /*!< Connect the Flash ECC double error detection flag with TIM1/15/16/17 break input      */
#define LL_SBS_TIMBREAK_CM7LCKUP      SBS_BKLOCKR_CM7LCKUP_BL /*!< Connect the Cortex M7 lockup output with TIM1/15/16/17 break input                    */
#define LL_SBS_TIMBREAK_BKRAMECC      SBS_BKLOCKR_BKRAMECC_BL /*!< Connect the Backup RAM ECC double error detection flag with TIM1/15/16/17 break input */
#define LL_SBS_TIMBREAK_DTCMECC       SBS_BKLOCKR_DTCMECC_BL  /*!< Connect the DTCM ECC double error detection flag with TIM1/15/16/17 break input       */
#define LL_SBS_TIMBREAK_ITCMECC       SBS_BKLOCKR_ITCMECC_BL  /*!< Connect the ITCM ECC double error detection flag with TIM1/15/16/17 break input       */
#define LL_SBS_TIMBREAK_ARAM3ECC      SBS_BKLOCKR_ARAM3ECC_BL /*!< Connect the AXISRAM3 ECC double error detection flag with TIM1/15/16/17 break input    */
#define LL_SBS_TIMBREAK_ARAM1ECC      SBS_BKLOCKR_ARAM1ECC_BL /*!< Connect the AXISRAM1 ECC double error detection flag with TIM1/15/16/17 break input    */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_SBS_EXTI_PORT SBS EXTI PORT
  * @{
  */
#define LL_SBS_EXTI_PORTA             0U                                                   /*!< EXTI PORT A */
#define LL_SBS_EXTI_PORTB             SBS_EXTICR1_PC_EXTI0_0                               /*!< EXTI PORT B */
#define LL_SBS_EXTI_PORTC             SBS_EXTICR1_PC_EXTI0_1                               /*!< EXTI PORT C */
#define LL_SBS_EXTI_PORTD             (SBS_EXTICR1_PC_EXTI0_1 | SBS_EXTICR1_PC_EXTI0_0)    /*!< EXTI PORT D */
#define LL_SBS_EXTI_PORTE             SBS_EXTICR1_PC_EXTI0_2                               /*!< EXTI PORT E */
#define LL_SBS_EXTI_PORTF             (SBS_EXTICR1_PC_EXTI0_2 | SBS_EXTICR1_PC_EXTI0_0)    /*!< EXTI PORT F */
#define LL_SBS_EXTI_PORTG             (SBS_EXTICR1_PC_EXTI0_2 | SBS_EXTICR1_PC_EXTI0_1)    /*!< EXTI PORT G */
#define LL_SBS_EXTI_PORTH             (SBS_EXTICR1_PC_EXTI0_2 | SBS_EXTICR1_PC_EXTI0_1 | \
                                       SBS_EXTICR1_PC_EXTI0_0)                             /*!< EXTI PORT H */
#define LL_SBS_EXTI_PORTM             (SBS_EXTICR1_PC_EXTI0_3 | SBS_EXTICR1_PC_EXTI0_2)    /*!< EXTI PORT M */
#define LL_SBS_EXTI_PORTN             (SBS_EXTICR1_PC_EXTI0_3 | SBS_EXTICR1_PC_EXTI0_2 | \
                                       SBS_EXTICR1_PC_EXTI0_0)                             /*!< EXTI PORT N */
#define LL_SBS_EXTI_PORTO             (SBS_EXTICR1_PC_EXTI0_3 | SBS_EXTICR1_PC_EXTI0_2 | \
                                       SBS_EXTICR1_PC_EXTI0_1)                             /*!< EXTI PORT 0 */
#define LL_SBS_EXTI_PORTP             (SBS_EXTICR1_PC_EXTI0_3 | SBS_EXTICR1_PC_EXTI0_2 | \
                                       SBS_EXTICR1_PC_EXTI0_1 | SBS_EXTICR1_PC_EXTI0_0)    /*!< EXTI PORT P */
/**
  * @}
  */

