RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_ll_system.h
/** @defgroup SYSTEM_LL_EC_SBS_EXTI_LINE SBS EXTI LINE
  * @{
  */
#define LL_SBS_EXTI_LINE0             ((0U  << LL_SBS_REGISTER_PINPOS_SHFT) | 0U)  /*!< EXTI_POSITION_0  | EXTICR[0] */
#define LL_SBS_EXTI_LINE1             ((4U  << LL_SBS_REGISTER_PINPOS_SHFT) | 0U)  /*!< EXTI_POSITION_8  | EXTICR[0] */
#define LL_SBS_EXTI_LINE2             ((8U  << LL_SBS_REGISTER_PINPOS_SHFT) | 0U)  /*!< EXTI_POSITION_16 | EXTICR[0] */
#define LL_SBS_EXTI_LINE3             ((12U << LL_SBS_REGISTER_PINPOS_SHFT) | 0U)  /*!< EXTI_POSITION_24 | EXTICR[0] */
#define LL_SBS_EXTI_LINE4             ((0U  << LL_SBS_REGISTER_PINPOS_SHFT) | 1U)  /*!< EXTI_POSITION_0  | EXTICR[1] */
#define LL_SBS_EXTI_LINE5             ((4U  << LL_SBS_REGISTER_PINPOS_SHFT) | 1U)  /*!< EXTI_POSITION_8  | EXTICR[1] */
#define LL_SBS_EXTI_LINE6             ((8U  << LL_SBS_REGISTER_PINPOS_SHFT) | 1U)  /*!< EXTI_POSITION_16 | EXTICR[1] */
#define LL_SBS_EXTI_LINE7             ((12U << LL_SBS_REGISTER_PINPOS_SHFT) | 1U)  /*!< EXTI_POSITION_24 | EXTICR[1] */
#define LL_SBS_EXTI_LINE8             ((0U  << LL_SBS_REGISTER_PINPOS_SHFT) | 2U)  /*!< EXTI_POSITION_0  | EXTICR[2] */
#define LL_SBS_EXTI_LINE9             ((4U  << LL_SBS_REGISTER_PINPOS_SHFT) | 2U)  /*!< EXTI_POSITION_8  | EXTICR[2] */
#define LL_SBS_EXTI_LINE10            ((8U  << LL_SBS_REGISTER_PINPOS_SHFT) | 2U)  /*!< EXTI_POSITION_16 | EXTICR[2] */
#define LL_SBS_EXTI_LINE11            ((12U << LL_SBS_REGISTER_PINPOS_SHFT) | 2U)  /*!< EXTI_POSITION_24 | EXTICR[2] */
#define LL_SBS_EXTI_LINE12            ((0U  << LL_SBS_REGISTER_PINPOS_SHFT) | 3U)  /*!< EXTI_POSITION_0  | EXTICR[3] */
#define LL_SBS_EXTI_LINE13            ((4U  << LL_SBS_REGISTER_PINPOS_SHFT) | 3U)  /*!< EXTI_POSITION_8  | EXTICR[3] */
#define LL_SBS_EXTI_LINE14            ((8U  << LL_SBS_REGISTER_PINPOS_SHFT) | 3U)  /*!< EXTI_POSITION_16 | EXTICR[3] */
#define LL_SBS_EXTI_LINE15            ((12U << LL_SBS_REGISTER_PINPOS_SHFT) | 3U)  /*!< EXTI_POSITION_24 | EXTICR[3] */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_DBGMCU_DCRT DBGMCU Debug credential reset type
  * @{
  */
#define LL_DBGMCU_DCRT_SYSTEM         0U              /*!< System reset revoke the debug authentication credentials */
#define LL_DBGMCU_DCRT_POWER          DBGMCU_CR_DCRT  /*!< Power reset revoke the debug authentication credentials */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_DBGMCU_AHB5_STOP DBGMCU AHB5 GRP1 STOP
  * @{
  */
#define LL_DBGMCU_AHB5_GRP1_HPDMA0_STOP    DBGMCU_AHB5FZR_HPDMA_0   /*!< The counter clock of HPDMA0 is stopped when the core is halted*/
#define LL_DBGMCU_AHB5_GRP1_HPDMA1_STOP    DBGMCU_AHB5FZR_HPDMA_1   /*!< The counter clock of HPDMA1 is stopped when the core is halted*/
#define LL_DBGMCU_AHB5_GRP1_HPDMA2_STOP    DBGMCU_AHB5FZR_HPDMA_2   /*!< The counter clock of HPDMA2 is stopped when the core is halted*/
#define LL_DBGMCU_AHB5_GRP1_HPDMA3_STOP    DBGMCU_AHB5FZR_HPDMA_3   /*!< The counter clock of HPDMA3 is stopped when the core is halted*/
#define LL_DBGMCU_AHB5_GRP1_HPDMA4_STOP    DBGMCU_AHB5FZR_HPDMA_4   /*!< The counter clock of HPDMA4 is stopped when the core is halted*/
#define LL_DBGMCU_AHB5_GRP1_HPDMA5_STOP    DBGMCU_AHB5FZR_HPDMA_5   /*!< The counter clock of HPDMA5 is stopped when the core is halted*/
#define LL_DBGMCU_AHB5_GRP1_HPDMA6_STOP    DBGMCU_AHB5FZR_HPDMA_6   /*!< The counter clock of HPDMA6 is stopped when the core is halted*/
#define LL_DBGMCU_AHB5_GRP1_HPDMA7_STOP    DBGMCU_AHB5FZR_HPDMA_7   /*!< The counter clock of HPDMA7 is stopped when the core is halted*/
#define LL_DBGMCU_AHB5_GRP1_HPDMA8_STOP    DBGMCU_AHB5FZR_HPDMA_8   /*!< The counter clock of HPDMA8 is stopped when the core is halted*/
#define LL_DBGMCU_AHB5_GRP1_HPDMA9_STOP    DBGMCU_AHB5FZR_HPDMA_9   /*!< The counter clock of HPDMAM9 is stopped when the core is halted*/
#define LL_DBGMCU_AHB5_GRP1_HPDMA10_STOP   DBGMCU_AHB5FZR_HPDMA_10  /*!< The counter clock of HPDMAM10 is stopped when the core is halted*/
#define LL_DBGMCU_AHB5_GRP1_HPDMA11_STOP   DBGMCU_AHB5FZR_HPDMA_11  /*!< The counter clock of HPDMAM11 is stopped when the core is halted*/
#define LL_DBGMCU_AHB5_GRP1_HPDMA12_STOP   DBGMCU_AHB5FZR_HPDMA_12  /*!< The counter clock of HPDMAM12 is stopped when the core is halted*/
#define LL_DBGMCU_AHB5_GRP1_HPDMA13_STOP   DBGMCU_AHB5FZR_HPDMA_13  /*!< The counter clock of HPDMAM13 is stopped when the core is halted*/
#define LL_DBGMCU_AHB5_GRP1_HPDMA14_STOP   DBGMCU_AHB5FZR_HPDMA_14  /*!< The counter clock of HPDMAM14 is stopped when the core is halted*/
#define LL_DBGMCU_AHB5_GRP1_HPDMA15_STOP   DBGMCU_AHB5FZR_HPDMA_15  /*!< The counter clock of HPDMAM15 is stopped when the core is halted*/
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_DBGMCU_AHB1_STOP DBGMCU AHB1 GRP1 STOP
  * @{
  */
#define LL_DBGMCU_AHB1_GRP1_GPDMA0_STOP    DBGMCU_AHB1FZR_GPDMA_0   /*!< The counter clock of GPDMA0 is stopped when the core is halted*/
#define LL_DBGMCU_AHB1_GRP1_GPDMA1_STOP    DBGMCU_AHB1FZR_GPDMA_1   /*!< The counter clock of GPDMA1 is stopped when the core is halted*/
#define LL_DBGMCU_AHB1_GRP1_GPDMA2_STOP    DBGMCU_AHB1FZR_GPDMA_2   /*!< The counter clock of GPDMA2 is stopped when the core is halted*/
#define LL_DBGMCU_AHB1_GRP1_GPDMA3_STOP    DBGMCU_AHB1FZR_GPDMA_3   /*!< The counter clock of GPDMA3 is stopped when the core is halted*/
#define LL_DBGMCU_AHB1_GRP1_GPDMA4_STOP    DBGMCU_AHB1FZR_GPDMA_4   /*!< The counter clock of GPDMA4 is stopped when the core is halted*/
#define LL_DBGMCU_AHB1_GRP1_GPDMA5_STOP    DBGMCU_AHB1FZR_GPDMA_5   /*!< The counter clock of GPDMA5 is stopped when the core is halted*/
#define LL_DBGMCU_AHB1_GRP1_GPDMA6_STOP    DBGMCU_AHB1FZR_GPDMA_6   /*!< The counter clock of GPDMA6 is stopped when the core is halted*/
#define LL_DBGMCU_AHB1_GRP1_GPDMA7_STOP    DBGMCU_AHB1FZR_GPDMA_7   /*!< The counter clock of GPDMA7 is stopped when the core is halted*/
#define LL_DBGMCU_AHB1_GRP1_GPDMA8_STOP    DBGMCU_AHB1FZR_GPDMA_8   /*!< The counter clock of GPDMA8 is stopped when the core is halted*/
#define LL_DBGMCU_AHB1_GRP1_GPDMA9_STOP    DBGMCU_AHB1FZR_GPDMA_9   /*!< The counter clock of GPDMAM9 is stopped when the core is halted*/
#define LL_DBGMCU_AHB1_GRP1_GPDMA10_STOP   DBGMCU_AHB1FZR_GPDMA_10  /*!< The counter clock of GPDMAM10 is stopped when the core is halted*/
#define LL_DBGMCU_AHB1_GRP1_GPDMA11_STOP   DBGMCU_AHB1FZR_GPDMA_11  /*!< The counter clock of GPDMAM11 is stopped when the core is halted*/
#define LL_DBGMCU_AHB1_GRP1_GPDMA12_STOP   DBGMCU_AHB1FZR_GPDMA_12  /*!< The counter clock of GPDMAM12 is stopped when the core is halted*/
#define LL_DBGMCU_AHB1_GRP1_GPDMA13_STOP   DBGMCU_AHB1FZR_GPDMA_13  /*!< The counter clock of GPDMAM13 is stopped when the core is halted*/
#define LL_DBGMCU_AHB1_GRP1_GPDMA14_STOP   DBGMCU_AHB1FZR_GPDMA_14  /*!< The counter clock of GPDMAM14 is stopped when the core is halted*/
#define LL_DBGMCU_AHB1_GRP1_GPDMA15_STOP   DBGMCU_AHB1FZR_GPDMA_15  /*!< The counter clock of GPDMAM15 is stopped when the core is halted*/
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_DBGMCU_APB1_STOP DBGMCU APB1 GRP1 STOP
  * @{
  */
#define LL_DBGMCU_APB1_GRP1_TIM2_STOP      DBGMCU_APB1FZR_TIM2   /*!< The counter clock of TIM2 is stopped when the core is halted*/
#define LL_DBGMCU_APB1_GRP1_TIM3_STOP      DBGMCU_APB1FZR_TIM3   /*!< The counter clock of TIM3 is stopped when the core is halted*/
#define LL_DBGMCU_APB1_GRP1_TIM4_STOP      DBGMCU_APB1FZR_TIM4   /*!< The counter clock of TIM4 is stopped when the core is halted*/
#define LL_DBGMCU_APB1_GRP1_TIM5_STOP      DBGMCU_APB1FZR_TIM5   /*!< The counter clock of TIM5 is stopped when the core is halted*/
#define LL_DBGMCU_APB1_GRP1_TIM6_STOP      DBGMCU_APB1FZR_TIM6   /*!< The counter clock of TIM6 is stopped when the core is halted*/
#define LL_DBGMCU_APB1_GRP1_TIM7_STOP      DBGMCU_APB1FZR_TIM7   /*!< The counter clock of TIM7 is stopped when the core is halted*/
#define LL_DBGMCU_APB1_GRP1_TIM12_STOP     DBGMCU_APB1FZR_TIM12  /*!< The counter clock of TIM12 is stopped when the core is halted*/
#define LL_DBGMCU_APB1_GRP1_TIM13_STOP     DBGMCU_APB1FZR_TIM13  /*!< The counter clock of TIM13 is stopped when the core is halted*/
#define LL_DBGMCU_APB1_GRP1_TIM14_STOP     DBGMCU_APB1FZR_TIM14  /*!< The counter clock of TIM14 is stopped when the core is halted*/
#define LL_DBGMCU_APB1_GRP1_LPTIM1_STOP    DBGMCU_APB1FZR_LPTIM1 /*!< The counter clock of LPTIM1 is stopped when the core is halted*/
#define LL_DBGMCU_APB1_GRP1_WWDG_STOP      DBGMCU_APB1FZR_WWDG   /*!< The window watchdog counter clock is stopped when the core is halted*/
#define LL_DBGMCU_APB1_GRP1_I2C1_STOP      DBGMCU_APB1FZR_I2C1   /*!< The I2C1 SMBus timeout is frozen*/
#define LL_DBGMCU_APB1_GRP1_I2C2_STOP      DBGMCU_APB1FZR_I2C2   /*!< The I2C2 SMBus timeout is frozen*/
#define LL_DBGMCU_APB1_GRP1_I2C3_STOP      DBGMCU_APB1FZR_I2C3   /*!< The I2C3 SMBus timeout is frozen*/
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_DBGMCU_APB2_STOP DBGMCU APB2 GRP1 STOP
  * @{
  */
#define LL_DBGMCU_APB2_GRP1_TIM1_STOP      DBGMCU_APB2FZR_TIM1     /*!< The counter clock of TIM1 is stopped when the core is halted*/
#define LL_DBGMCU_APB2_GRP1_TIM9_STOP      DBGMCU_APB2FZR_TIM9     /*!< The counter clock of TIM9 is stopped when the core is halted*/
#define LL_DBGMCU_APB2_GRP1_TIM15_STOP     DBGMCU_APB2FZR_TIM15    /*!< The counter clock of TIM15 is stopped when the core is halted*/
#define LL_DBGMCU_APB2_GRP1_TIM16_STOP     DBGMCU_APB2FZR_TIM16    /*!< The counter clock of TIM16 is stopped when the core is halted*/
#define LL_DBGMCU_APB2_GRP1_TIM17_STOP     DBGMCU_APB2FZR_TIM17    /*!< The counter clock of TIM17 is stopped when the core is halted*/
/**
  * @}
  */

