RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_ll_system.h
/** @defgroup SYSTEM_LL_EC_DBGMCU_APB4_STOP DBGMCU APB4 GRP1 STOP
  * @{
  */
#define LL_DBGMCU_APB4_GRP1_LPTIM2_STOP    DBGMCU_APB4FZR_LPTIM2 /*!< The counter clock of LPTIM2 is stopped when the core is halted*/
#define LL_DBGMCU_APB4_GRP1_LPTIM3_STOP    DBGMCU_APB4FZR_LPTIM3 /*!< The counter clock of LPTIM2 is stopped when the core is halted*/
#define LL_DBGMCU_APB4_GRP1_LPTIM4_STOP    DBGMCU_APB4FZR_LPTIM4 /*!< The counter clock of LPTIM4 is stopped when the core is halted*/
#define LL_DBGMCU_APB4_GRP1_LPTIM5_STOP    DBGMCU_APB4FZR_LPTIM5 /*!< The counter clock of LPTIM5 is stopped when the core is halted*/
#define LL_DBGMCU_APB4_GRP1_IWDG_STOP      DBGMCU_APB4FZR_IWDG   /*!< The counter clock of IWDG is stopped when the core is halted*/
#define LL_DBGMCU_APB4_GRP1_RTC_STOP       DBGMCU_APB4FZR_RTC    /*!< The counter clock of RTC is stopped when the core is halted*/
/**
  * @}
  */


#if defined(VREFBUF)
/** @defgroup SYSTEM_LL_EC_VOLTAGE VREFBUF VOLTAGE
  * @{
  */
#define LL_VREFBUF_VOLTAGE_SCALE0          VREFBUF_CSR_VRS_OUT1   /*!< Voltage reference scale 0 (VREF_OUT1) */
#define LL_VREFBUF_VOLTAGE_SCALE1          VREFBUF_CSR_VRS_OUT2   /*!< Voltage reference scale 1 (VREF_OUT2) */
#define LL_VREFBUF_VOLTAGE_SCALE2          VREFBUF_CSR_VRS_OUT3   /*!< Voltage reference scale 2 (VREF_OUT3) */
#define LL_VREFBUF_VOLTAGE_SCALE3          VREFBUF_CSR_VRS_OUT4   /*!< Voltage reference scale 3 (VREF_OUT4) */
/**
  * @}
  */
#endif /* VREFBUF */

/** @defgroup SYSTEM_LL_EC_LATENCY FLASH LATENCY
  * @{
  */
#define LL_FLASH_LATENCY_0        0                                                                 /*!< FLASH Zero wait state      */
#define LL_FLASH_LATENCY_1        FLASH_ACR_LATENCY_0                                               /*!< FLASH One wait state       */
#define LL_FLASH_LATENCY_2        FLASH_ACR_LATENCY_1                                               /*!< FLASH Two wait states      */
#define LL_FLASH_LATENCY_3        (FLASH_ACR_LATENCY_1 | FLASH_ACR_LATENCY_0)                       /*!< FLASH Three wait states    */
#define LL_FLASH_LATENCY_4        FLASH_ACR_LATENCY_2                                               /*!< FLASH Four wait states     */
#define LL_FLASH_LATENCY_5        (FLASH_ACR_LATENCY_2 | FLASH_ACR_LATENCY_0)                       /*!< FLASH Five wait state      */
#define LL_FLASH_LATENCY_6        (FLASH_ACR_LATENCY_2 | FLASH_ACR_LATENCY_1)                       /*!< FLASH Six wait state       */
#define LL_FLASH_LATENCY_7        (FLASH_ACR_LATENCY_2 | FLASH_ACR_LATENCY_1 | FLASH_ACR_LATENCY_0) /*!< FLASH Seven wait states    */
#define LL_FLASH_LATENCY_8        FLASH_ACR_LATENCY_3                                               /*!< FLASH Eight wait states    */
#define LL_FLASH_LATENCY_9        (FLASH_ACR_LATENCY_3 | FLASH_ACR_LATENCY_0)                       /*!< FLASH Nine wait states     */
#define LL_FLASH_LATENCY_10       (FLASH_ACR_LATENCY_3 | FLASH_ACR_LATENCY_1)                       /*!< FLASH Ten wait state       */
#define LL_FLASH_LATENCY_11       (FLASH_ACR_LATENCY_3 | FLASH_ACR_LATENCY_1 | FLASH_ACR_LATENCY_0) /*!< FLASH Eleven wait state    */
#define LL_FLASH_LATENCY_12       (FLASH_ACR_LATENCY_3 | FLASH_ACR_LATENCY_2)                       /*!< FLASH Twelve wait states   */
#define LL_FLASH_LATENCY_13       (FLASH_ACR_LATENCY_3 | FLASH_ACR_LATENCY_2 | FLASH_ACR_LATENCY_0) /*!< FLASH Thirteen wait states */
#define LL_FLASH_LATENCY_14       (FLASH_ACR_LATENCY_3 | FLASH_ACR_LATENCY_2 | FLASH_ACR_LATENCY_1) /*!< FLASH Fourteen wait states */
#define LL_FLASH_LATENCY_15       FLASH_ACR_LATENCY                                                 /*!< FLASH Fifteen wait states  */
/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/

/* Exported functions --------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Exported_Functions SYSTEM Exported Functions
  * @{
  */

/** @defgroup SYSTEM_LL_EF_SBS SBS
  * @{
  */

/**
  * @brief  Get initial vector for Cortex-M7
  * @rmtoll SBS_BOOTSR INITVTOR      LL_SBS_GetBootAddress
  * @retval Returned value is the physical boot address used by the Cortex-M7 after reset
  */
__STATIC_INLINE uint32_t LL_SBS_GetBootAddress(void)
{
  return (uint32_t)(READ_BIT(SBS->BOOTSR, SBS_BOOTSR_INITVTOR));
}

/**
  * @brief  Increment hide protection level
  * @rmtoll SBS_HDPLCR INCR_HDPL     LL_SBS_IncrementHDPL
  * @retval None
  */
__STATIC_INLINE void LL_SBS_IncrementHDPL(void)
{
  MODIFY_REG(SBS->HDPLCR, SBS_HDPLCR_INCR_HDPL, LL_SBS_HDPL_INCREMENT_VALUE);
}

/**
  * @brief  Get current hide protection level
  * @rmtoll SBS_HDPLSR HDPL          LL_SBS_GetCurrentHDPL
  * @retval Returned value is the current hide protection level of the device:
  *         @arg @ref LL_SBS_HDPL0
  *         @arg @ref LL_SBS_HDPL1
  *         @arg @ref LL_SBS_HDPL2
  *         @arg @ref LL_SBS_HDPL3
  */
__STATIC_INLINE uint32_t LL_SBS_GetCurrentHDPL(void)
{
  return (uint32_t)(READ_BIT(SBS->HDPLSR, SBS_HDPLSR_HDPL));
}

/**
  * @brief  Set the authenticated debug hide protection level
  * @rmtoll SBS_DBGCR DBG_AUTH_HDPL     LL_SBS_SetAuthDbgHDPL
  * @param  Level This parameter can be one of the following values:
  *         @arg @ref LL_SBS_HDPL1
  *         @arg @ref LL_SBS_HDPL2
  *         @arg @ref LL_SBS_HDPL3
  * @retval None
  */
__STATIC_INLINE void LL_SBS_SetAuthDbgHDPL(uint32_t Level)
{
  MODIFY_REG(SBS->DBGCR, SBS_DBGCR_DBG_AUTH_HDPL, (Level << SBS_DBGCR_DBG_AUTH_HDPL_Pos));
}

/**
  * @brief  Get current hide protection level
  * @rmtoll SBS_DBGCR DBG_AUTH_HDPL     LL_SBS_GetAuthDbgHDPL
  * @retval Returned value is the hide protection level where the authenticated debug is opened:
  *         @arg @ref LL_SBS_HDPL1
  *         @arg @ref LL_SBS_HDPL2
  *         @arg @ref LL_SBS_HDPL3
  */
__STATIC_INLINE uint32_t LL_SBS_GetAuthDbgHDPL(void)
{
  return (uint32_t)(READ_BIT(SBS->DBGCR, SBS_DBGCR_DBG_AUTH_HDPL) >> SBS_DBGCR_DBG_AUTH_HDPL_Pos);
}

/**
  * @brief  Unlock the debug
  * @rmtoll SBS_DBGCR DBG_UNLOCK     LL_SBS_UnlockDebug
  * @retval None
  */
__STATIC_INLINE void LL_SBS_UnlockDebug(void)
{
  MODIFY_REG(SBS->DBGCR, SBS_DBGCR_DBG_UNLOCK, LL_SBS_DBG_UNLOCK);
}

/**
  * @brief  Check if the debug is unlocked
  * @rmtoll SBS_DBGCR DBG_UNLOCK     LL_SBS_IsUnlockedDebug
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsUnlockedDebug(void)
{
  return ((READ_BIT(SBS->DBGCR, SBS_DBGCR_DBG_UNLOCK) == LL_SBS_DBG_UNLOCK) ? 1UL : 0UL);
}

/**
  * @brief  Unlock the access port
  * @rmtoll SBS_DBGCR AP_UNLOCK     LL_SBS_UnlockAccessPort
  * @retval None
  */
__STATIC_INLINE void LL_SBS_UnlockAccessPort(void)
{
  MODIFY_REG(SBS->DBGCR, SBS_DBGCR_AP_UNLOCK, LL_SBS_ACCESS_PORT_UNLOCK);
}

/**
  * @brief  Check if the access port is unlocked
  * @rmtoll SBS_DBGCR AP_UNLOCK     LL_SBS_IsUnlockedAccessPort
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsUnlockedAccessPort(void)
{
  return ((READ_BIT(SBS->DBGCR, SBS_DBGCR_AP_UNLOCK) == LL_SBS_ACCESS_PORT_UNLOCK) ? 1UL : 0UL);
}

/**
  * @brief  Lock the debug configuration
  * @rmtoll SBS_DBGLOCKR DBGCFG_LOCK     LL_SBS_LockDebugConfig
  * @retval None
  */
__STATIC_INLINE void LL_SBS_LockDebugConfig(void)
{
  MODIFY_REG(SBS->DBGLOCKR, SBS_DBGLOCKR_DBGCFG_LOCK, LL_SBS_DBG_CONFIG_LOCK);
}

/**
  * @brief  Unlock the debug configuration
  * @rmtoll SBS_DBGLOCKR DBGCFG_LOCK     LL_SBS_UnlockDebugConfig
  * @retval None
  */
__STATIC_INLINE void LL_SBS_UnlockDebugConfig(void)
{
  MODIFY_REG(SBS->DBGLOCKR, SBS_DBGLOCKR_DBGCFG_LOCK, LL_SBS_DBG_CONFIG_UNLOCK);
}

/**
  * @brief  Check if the debug configuration is unlocked
  * @rmtoll SBS_DBGLOCKR DBGCFG_LOCK     LL_SBS_IsUnlockedDebugConfig
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsUnlockedDebugConfig(void)
{
  return ((READ_BIT(SBS->DBGLOCKR, SBS_DBGLOCKR_DBGCFG_LOCK) == LL_SBS_DBG_CONFIG_UNLOCK) ? 1UL : 0UL);
}

/**
  * @brief  Set the command to be passed to RSS
  * @rmtoll SBS_RSSCMDR RSSCMD     LL_SBS_SetRSSCmd
  * @param  Command This parameter can have a value between 0 and 0xFFFF
  * @retval None
  */
__STATIC_INLINE void LL_SBS_SetRSSCmd(uint32_t Command)
{
  MODIFY_REG(SBS->RSSCMDR, SBS_RSSCMDR_RSSCMD, Command);
}

/**
  * @brief  Get the command which will be passed to RSS
  * @rmtoll SBS_RSSCMDR RSSCMD     LL_SBS_GetRSSCmd
  * @retval Returned value is the command which will be passed to RSS (value between 0 and 0xFFFF)
  */
__STATIC_INLINE uint32_t LL_SBS_GetRSSCmd(void)
{
  return (uint32_t)(READ_BIT(SBS->RSSCMDR, SBS_RSSCMDR_RSSCMD));
}

/**
  * @brief  Set the number of AXISRAM wait state (when ECC=0)
  * @rmtoll SBS_PMCR AXISRAM_WS     LL_SBS_SetAXISRAMWaitState
  * @param  WaitState This parameter can be one of the following values:
  *         @arg @ref LL_SBS_AXISRAM_NO_WS
  *         @arg @ref LL_SBS_AXISRAM_ONE_WS
  * @retval None
  */
__STATIC_INLINE void LL_SBS_SetAXISRAMWaitState(uint32_t WaitState)
{
  MODIFY_REG(SBS->PMCR, SBS_PMCR_AXISRAM_WS, WaitState);
}

/**
  * @brief  Get the number of AXISRAM wait state (when ECC=0)
  * @rmtoll SBS_PMCR AXISRAM_WS     LL_SBS_GetAXISRAMWaitState
  * @retval Returned value is the number of wait state when accessing AXISRAM:
  *         @arg @ref LL_SBS_AXISRAM_NO_WS
  *         @arg @ref LL_SBS_AXISRAM_ONE_WS
  */
__STATIC_INLINE uint32_t LL_SBS_GetAXISRAMWaitState(void)
{
  return (uint32_t)(READ_BIT(SBS->PMCR, SBS_PMCR_AXISRAM_WS));
}

/**
  * @brief  Configure the Ethernet PHY interface
  * @rmtoll SBS_PMCR ETH_PHYSEL     LL_SBS_SetEthernetPhy
  * @param  Interface This parameter can be one of the following values:
  *         @arg @ref LL_SBS_ETH_PHYSEL_GMII_MII
  *         @arg @ref LL_SBS_ETH_PHYSEL_RMII
  * @retval None
  */
__STATIC_INLINE void LL_SBS_SetEthernetPhy(uint32_t Interface)
{
  MODIFY_REG(SBS->PMCR, SBS_PMCR_ETH_PHYSEL, Interface);
}

/**
  * @brief  Get the selected Ethernet PHY interface
  * @rmtoll SBS_PMCR ETH_PHYSEL     LL_SBS_GetEthernetPhy
  * @retval Returned value is the selected Ethernet PHY interface:
  *         @arg @ref LL_SBS_ETH_PHYSEL_GMII_MII
  *         @arg @ref LL_SBS_ETH_PHYSEL_RMII
  */
__STATIC_INLINE uint32_t LL_SBS_GetEthernetPhy(void)
{
  return (uint32_t)(READ_BIT(SBS->PMCR, SBS_PMCR_ETH_PHYSEL));
}

/**
  * @brief  Configure the analog switch supply voltage for booster
  * @rmtoll SBS_PMCR BOOSTVDDSEL     LL_SBS_SetBoosterVoltage
  * @param  Voltage This parameter can be one of the following values:
  *         @arg @ref LL_SBS_BOOSTVDDSEL_VDDA
  *         @arg @ref LL_SBS_BOOSTVDDSEL_VDD
  * @retval None
  */
__STATIC_INLINE void LL_SBS_SetBoosterVoltage(uint32_t Voltage)
{
  MODIFY_REG(SBS->PMCR, SBS_PMCR_BOOSTVDDSEL, Voltage);
}

/**
  * @brief  Get the selected analog switch supply voltage for booster
  * @rmtoll SBS_PMCR BOOSTVDDSEL     LL_SBS_GetBoosterVoltage
  * @retval Returned value is the selected analog switch supply voltage:
  *         @arg @ref LL_SBS_BOOSTVDDSEL_VDDA
  *         @arg @ref LL_SBS_BOOSTVDDSEL_VDD
  */
__STATIC_INLINE uint32_t LL_SBS_GetBoosterVoltage(void)
{
  return (uint32_t)(READ_BIT(SBS->PMCR, SBS_PMCR_BOOSTVDDSEL));
}

/**
  * @brief  Enable the booster
  * @rmtoll SBS_PMCR BOOSTEN     LL_SBS_EnableBooster
  * @retval None
  */
__STATIC_INLINE void LL_SBS_EnableBooster(void)
{
  SET_BIT(SBS->PMCR, SBS_PMCR_BOOSTEN);
}

/**
  * @brief  Disable the booster
  * @rmtoll SBS_PMCR BOOSTEN     LL_SBS_DisableBooster
  * @retval None
  */
__STATIC_INLINE void LL_SBS_DisableBooster(void)
{
  CLEAR_BIT(SBS->PMCR, SBS_PMCR_BOOSTEN);
}

/**
  * @brief  Check if the booster is enabled
  * @rmtoll SBS_PMCR BOOSTEN     LL_SBS_IsEnabledBooster
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledBooster(void)
{
  return ((READ_BIT(SBS->PMCR, SBS_PMCR_BOOSTEN) != 0UL) ? 1UL : 0UL);
}

/**
  * @brief  Enable Floating Point Unit Invalid operation Interrupt
  * @rmtoll SBS_FPUIMR FPU_IE_0      LL_SBS_EnableIT_FPU_IOC
  * @retval None
  */
__STATIC_INLINE void LL_SBS_EnableIT_FPU_IOC(void)
{
  SET_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_0);
}

/**
  * @brief  Enable Floating Point Unit Divide-by-zero Interrupt
  * @rmtoll SBS_FPUIMR FPU_IE_1      LL_SBS_EnableIT_FPU_DZC
  * @retval None
  */
__STATIC_INLINE void LL_SBS_EnableIT_FPU_DZC(void)
{
  SET_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_1);
}

/**
  * @brief  Enable Floating Point Unit Underflow Interrupt
  * @rmtoll SBS_FPUIMR FPU_IE_2      LL_SBS_EnableIT_FPU_UFC
  * @retval None
  */
__STATIC_INLINE void LL_SBS_EnableIT_FPU_UFC(void)
{
  SET_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_2);
}

/**
  * @brief  Enable Floating Point Unit Overflow Interrupt
  * @rmtoll SBS_FPUIMR FPU_IE_3      LL_SBS_EnableIT_FPU_OFC
  * @retval None
  */
__STATIC_INLINE void LL_SBS_EnableIT_FPU_OFC(void)
{
  SET_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_3);
}

/**
  * @brief  Enable Floating Point Unit Input denormal Interrupt
  * @rmtoll SBS_FPUIMR FPU_IE_4      LL_SBS_EnableIT_FPU_IDC
  * @retval None
  */
__STATIC_INLINE void LL_SBS_EnableIT_FPU_IDC(void)
{
  SET_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_4);
}

/**
  * @brief  Enable Floating Point Unit Inexact Interrupt
  * @rmtoll SBS_FPUIMR FPU_IE_5      LL_SBS_EnableIT_FPU_IXC
  * @retval None
  */
__STATIC_INLINE void LL_SBS_EnableIT_FPU_IXC(void)
{
  SET_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_5);
}

/**
  * @brief  Disable Floating Point Unit Invalid operation Interrupt
  * @rmtoll SBS_FPUIMR FPU_IE_0      LL_SBS_DisableIT_FPU_IOC
  * @retval None
  */
__STATIC_INLINE void LL_SBS_DisableIT_FPU_IOC(void)
{
  CLEAR_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_0);
}

/**
  * @brief  Disable Floating Point Unit Divide-by-zero Interrupt
  * @rmtoll SBS_FPUIMR FPU_IE_1      LL_SBS_DisableIT_FPU_DZC
  * @retval None
  */
__STATIC_INLINE void LL_SBS_DisableIT_FPU_DZC(void)
{
  CLEAR_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_1);
}

/**
  * @brief  Disable Floating Point Unit Underflow Interrupt
  * @rmtoll SBS_FPUIMR FPU_IE_2      LL_SBS_DisableIT_FPU_UFC
  * @retval None
  */
__STATIC_INLINE void LL_SBS_DisableIT_FPU_UFC(void)
{
  CLEAR_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_2);
}

/**
  * @brief  Disable Floating Point Unit Overflow Interrupt
  * @rmtoll SBS_FPUIMR FPU_IE_3      LL_SBS_DisableIT_FPU_OFC
  * @retval None
  */
__STATIC_INLINE void LL_SBS_DisableIT_FPU_OFC(void)
{
  CLEAR_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_3);
}

/**
  * @brief  Disable Floating Point Unit Input denormal Interrupt
  * @rmtoll SBS_FPUIMR FPU_IE_4      LL_SBS_DisableIT_FPU_IDC
  * @retval None
  */
__STATIC_INLINE void LL_SBS_DisableIT_FPU_IDC(void)
{
  CLEAR_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_4);
}

/**
  * @brief  Disable Floating Point Unit Inexact Interrupt
  * @rmtoll SBS_FPUIMR FPU_IE_5      LL_SBS_DisableIT_FPU_IXC
  * @retval None
  */
__STATIC_INLINE void LL_SBS_DisableIT_FPU_IXC(void)
{
  CLEAR_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_5);
}

/**
  * @brief  Check if Floating Point Unit Invalid operation Interrupt source is enabled or disabled.
  * @rmtoll SBS_FPUIMR FPU_IE_0      LL_SBS_IsEnabledIT_FPU_IOC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledIT_FPU_IOC(void)
{
  return ((READ_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_0) == SBS_FPUIMR_FPU_IE_0) ? 1UL : 0UL);
}

/**
  * @brief  Check if Floating Point Unit Divide-by-zero Interrupt source is enabled or disabled.
  * @rmtoll SBS_FPUIMR FPU_IE_1      LL_SBS_IsEnabledIT_FPU_DZC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledIT_FPU_DZC(void)
{
  return ((READ_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_1) == SBS_FPUIMR_FPU_IE_1) ? 1UL : 0UL);
}

/**
  * @brief  Check if Floating Point Unit Underflow Interrupt source is enabled or disabled.
  * @rmtoll SBS_FPUIMR FPU_IE_2      LL_SBS_IsEnabledIT_FPU_UFC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledIT_FPU_UFC(void)
{
  return ((READ_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_2) == SBS_FPUIMR_FPU_IE_2) ? 1UL : 0UL);
}

/**
  * @brief  Check if Floating Point Unit Overflow Interrupt source is enabled or disabled.
  * @rmtoll SBS_FPUIMR FPU_IE_3      LL_SBS_IsEnabledIT_FPU_OFC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledIT_FPU_OFC(void)
{
  return ((READ_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_3) == SBS_FPUIMR_FPU_IE_3) ? 1UL : 0UL);
}

/**
  * @brief  Check if Floating Point Unit Input denormal Interrupt source is enabled or disabled.
  * @rmtoll SBS_FPUIMR FPU_IE_4      LL_SBS_IsEnabledIT_FPU_IDC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledIT_FPU_IDC(void)
{
  return ((READ_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_4) == SBS_FPUIMR_FPU_IE_4) ? 1UL : 0UL);
}

/**
  * @brief  Check if Floating Point Unit Inexact Interrupt source is enabled or disabled.
  * @rmtoll SBS_FPUIMR FPU_IE_5      LL_SBS_IsEnabledIT_FPU_IXC
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledIT_FPU_IXC(void)
{
  return ((READ_BIT(SBS->FPUIMR, SBS_FPUIMR_FPU_IE_5) == SBS_FPUIMR_FPU_IE_5) ? 1UL : 0UL);
}

/**
  * @brief  Check if the automatic erase of BKPRAM and PKARAM memories are done
  * @rmtoll SBS_MESR MEF     LL_SBS_IsDoneMemoryErase
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsDoneMemoryErase(void)
{
  return (READ_BIT(SBS->MESR, SBS_MESR_MEF));
}

/**
  * @brief  Enable the XSPI2 speed optimization
  * @rmtoll SBS_CCCSR XSPI2_IOHSLV     LL_SBS_EnableXSPI2SpeedOptim
  * @retval None
  */
__STATIC_INLINE void LL_SBS_EnableXSPI2SpeedOptim(void)
{
  SET_BIT(SBS->CCCSR, SBS_CCCSR_XSPI2_IOHSLV);
}

/**
  * @brief  Disable the XSPI2 speed optimization
  * @rmtoll SBS_CCCSR XSPI2_IOHSLV     LL_SBS_DisableXSPI2SpeedOptim
  * @retval None
  */
__STATIC_INLINE void LL_SBS_DisableXSPI2SpeedOptim(void)
{
  CLEAR_BIT(SBS->CCCSR, SBS_CCCSR_XSPI2_IOHSLV);
}

/**
  * @brief  Check if the XSPI2 speed optimization is enabled
  * @rmtoll SBS_CCCSR XSPI2_IOHSLV     LL_SBS_IsEnabledXSPI2SpeedOptim
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledXSPI2SpeedOptim(void)
{
  return ((READ_BIT(SBS->CCCSR, SBS_CCCSR_XSPI2_IOHSLV) != 0UL) ? 1UL : 0UL);
}

/**
  * @brief  Enable the XSPI1 speed optimization
  * @rmtoll SBS_CCCSR XSPI1_IOHSLV     LL_SBS_EnableXSPI1SpeedOptim
  * @retval None
  */
__STATIC_INLINE void LL_SBS_EnableXSPI1SpeedOptim(void)
{
  SET_BIT(SBS->CCCSR, SBS_CCCSR_XSPI1_IOHSLV);
}

/**
  * @brief  Disable the XSPI1 speed optimization
  * @rmtoll SBS_CCCSR XSPI1_IOHSLV     LL_SBS_DisableXSPI1SpeedOptim
  * @retval None
  */
__STATIC_INLINE void LL_SBS_DisableXSPI1SpeedOptim(void)
{
  CLEAR_BIT(SBS->CCCSR, SBS_CCCSR_XSPI1_IOHSLV);
}

/**
  * @brief  Check if the XSPI1 speed optimization is enabled
  * @rmtoll SBS_CCCSR XSPI1_IOHSLV     LL_SBS_IsEnabledXSPI1SpeedOptim
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledXSPI1SpeedOptim(void)
{
  return ((READ_BIT(SBS->CCCSR, SBS_CCCSR_XSPI1_IOHSLV) != 0UL) ? 1UL : 0UL);
}

/**
  * @brief  Enable the I/O speed optimization
  * @rmtoll SBS_CCCSR IOHSLV     LL_SBS_EnableIOSpeedOptim
  * @retval None
  */
__STATIC_INLINE void LL_SBS_EnableIOSpeedOptim(void)
{
  SET_BIT(SBS->CCCSR, SBS_CCCSR_IOHSLV);
}

/**
  * @brief  Disable the I/O speed optimization
  * @rmtoll SBS_CCCSR IOHSLV     LL_SBS_DisableIOSpeedOptim
  * @retval None
  */
__STATIC_INLINE void LL_SBS_DisableIOSpeedOptim(void)
{
  CLEAR_BIT(SBS->CCCSR, SBS_CCCSR_IOHSLV);
}

/**
  * @brief  Check if the I/O speed optimization is enabled
  * @rmtoll SBS_CCCSR IOHSLV     LL_SBS_IsEnabledIOSpeedOptim
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledIOSpeedOptim(void)
{
  return ((READ_BIT(SBS->CCCSR, SBS_CCCSR_IOHSLV) != 0UL) ? 1UL : 0UL);
}

/**
  * @brief  Check if the XSPI2 compensation cell is ready
  * @rmtoll SBS_CCCSR XSPI2_COMP_RDY     LL_SBS_IsReadyXSPI2CompCell
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsReadyXSPI2CompCell(void)
{
  return ((READ_BIT(SBS->CCCSR, SBS_CCCSR_XSPI2_COMP_RDY) != 0UL) ? 1UL : 0UL);
}

/**
  * @brief  Check if the XSPI1 compensation cell is ready
  * @rmtoll SBS_CCCSR XSPI1_COMP_RDY     LL_SBS_IsReadyXSPI1CompCell
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsReadyXSPI1CompCell(void)
{
  return ((READ_BIT(SBS->CCCSR, SBS_CCCSR_XSPI1_COMP_RDY) != 0UL) ? 1UL : 0UL);
}

/**
  * @brief  Check if the I/O compensation cell is ready
  * @rmtoll SBS_CCCSR COMP_RDY     LL_SBS_IsReadyIOCompCell
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsReadyIOCompCell(void)
{
  return ((READ_BIT(SBS->CCCSR, SBS_CCCSR_COMP_RDY) != 0UL) ? 1UL : 0UL);
}

/**
  * @brief  Configure the code for the XSPI2 compensation cell
  * @rmtoll SBS_CCCSR XSPI2_COMP_CODESEL     LL_SBS_SetXSPI2CompCellCode
  * @param  Code This parameter can be one of the following values:
  *         @arg @ref LL_SBS_XSPI2_CODE_CELL
  *         @arg @ref LL_SBS_XSPI2_CODE_REG
  * @retval None
  */
__STATIC_INLINE void LL_SBS_SetXSPI2CompCellCode(uint32_t Code)
{
  MODIFY_REG(SBS->CCCSR, SBS_CCCSR_XSPI2_COMP_CODESEL, Code);
}

/**
  * @brief  Get the selected code for the XSPI2 compensation cell
  * @rmtoll SBS_CCCSR XSPI2_COMP_CODESEL     LL_SBS_GetXSPI2CompCellCode
  * @retval Returned value is the selected code for the XSPI2 compensation cell:
  *         @arg @ref LL_SBS_XSPI2_CODE_CELL
  *         @arg @ref LL_SBS_XSPI2_CODE_REG
  */
__STATIC_INLINE uint32_t LL_SBS_GetXSPI2CompCellCode(void)
{
  return (uint32_t)(READ_BIT(SBS->CCCSR, SBS_CCCSR_XSPI2_COMP_CODESEL));
}

/**
  * @brief  Enable the XSPI2 compensation cell
  * @rmtoll SBS_PMCR XSPI2_COMP_EN     LL_SBS_EnableXSPI2CompCell
  * @retval None
  */
__STATIC_INLINE void LL_SBS_EnableXSPI2CompCell(void)
{
  SET_BIT(SBS->CCCSR, SBS_CCCSR_XSPI2_COMP_EN);
}

/**
  * @brief  Disable the XSPI2 compensation cell
  * @rmtoll SBS_CCCSR XSPI2_COMP_EN     LL_SBS_DisableXSPI2CompCell
  * @retval None
  */
__STATIC_INLINE void LL_SBS_DisableXSPI2CompCell(void)
{
  CLEAR_BIT(SBS->CCCSR, SBS_CCCSR_XSPI2_COMP_EN);
}

/**
  * @brief  Check if the XSPI2 compensation cell is enabled
  * @rmtoll SBS_CCCSR XSPI2_COMP_EN     LL_SBS_IsEnabledXSPI2CompCell
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledXSPI2CompCell(void)
{
  return ((READ_BIT(SBS->CCCSR, SBS_CCCSR_XSPI2_COMP_EN) != 0UL) ? 1UL : 0UL);
}

/**
  * @brief  Configure the code for the XSPI1 compensation cell
  * @rmtoll SBS_CCCSR XSPI1_COMP_CODESEL     LL_SBS_SetXSPI1CompCellCode
  * @param  Code This parameter can be one of the following values:
  *         @arg @ref LL_SBS_XSPI1_CODE_CELL
  *         @arg @ref LL_SBS_XSPI1_CODE_REG
  * @retval None
  */
__STATIC_INLINE void LL_SBS_SetXSPI1CompCellCode(uint32_t Code)
{
  MODIFY_REG(SBS->CCCSR, SBS_CCCSR_XSPI1_COMP_CODESEL, Code);
}

/**
  * @brief  Get the selected code for the XSPI2 compensation cell
  * @rmtoll SBS_CCCSR XSPI1_COMP_CODESEL     LL_SBS_GetXSPI1CompCellCode
  * @retval Returned value is the selected code for the XSPI1 compensation cell:
  *         @arg @ref LL_SBS_XSPI1_CODE_CELL
  *         @arg @ref LL_SBS_XSPI1_CODE_REG
  */
__STATIC_INLINE uint32_t LL_SBS_GetXSPI1CompCellCode(void)
{
  return (uint32_t)(READ_BIT(SBS->CCCSR, SBS_CCCSR_XSPI1_COMP_CODESEL));
}

/**
  * @brief  Enable the XSPI1 compensation cell
  * @rmtoll SBS_PMCR XSPI1_COMP_EN     LL_SBS_EnableXSPI1CompCell
  * @retval None
  */
__STATIC_INLINE void LL_SBS_EnableXSPI1CompCell(void)
{
  SET_BIT(SBS->CCCSR, SBS_CCCSR_XSPI1_COMP_EN);
}

/**
  * @brief  Disable the XSPI1 compensation cell
  * @rmtoll SBS_CCCSR XSPI1_COMP_EN     LL_SBS_DisableXSPI1CompCell
  * @retval None
  */
__STATIC_INLINE void LL_SBS_DisableXSPI1CompCell(void)
{
  CLEAR_BIT(SBS->CCCSR, SBS_CCCSR_XSPI1_COMP_EN);
}

