RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_ll_system.h
/**
  * @brief  Check if the XSPI1 compensation cell is enabled
  * @rmtoll SBS_CCCSR XSPI1_COMP_EN     LL_SBS_IsEnabledXSPI1CompCell
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledXSPI1CompCell(void)
{
  return ((READ_BIT(SBS->CCCSR, SBS_CCCSR_XSPI1_COMP_EN) != 0UL) ? 1UL : 0UL);
}

/**
  * @brief  Configure the code for the I/O compensation cell
  * @rmtoll SBS_CCCSR COMP_CODESEL     LL_SBS_SetIOCompCellCode
  * @param  Code This parameter can be one of the following values:
  *         @arg @ref LL_SBS_IO_CODE_CELL
  *         @arg @ref LL_SBS_IO_CODE_REG
  * @retval None
  */
__STATIC_INLINE void LL_SBS_SetIOCompCellCode(uint32_t Code)
{
  MODIFY_REG(SBS->CCCSR, SBS_CCCSR_COMP_CODESEL, Code);
}

/**
  * @brief  Get the selected code for the I/O compensation cell
  * @rmtoll SBS_CCCSR COMP_CODESEL     LL_SBS_GetIOCompCellCode
  * @retval Returned value is the selected code for the I/O compensation cell:
  *         @arg @ref LL_SBS_IO_CODE_CELL
  *         @arg @ref LL_SBS_IO_CODE_REG
  */
__STATIC_INLINE uint32_t LL_SBS_GetIOCompCellCode(void)
{
  return (uint32_t)(READ_BIT(SBS->CCCSR, SBS_CCCSR_COMP_CODESEL));
}

/**
  * @brief  Enable the I/O compensation cell
  * @rmtoll SBS_PMCR COMP_EN     LL_SBS_EnableIOCompCell
  * @retval None
  */
__STATIC_INLINE void LL_SBS_EnableIOCompCell(void)
{
  SET_BIT(SBS->CCCSR, SBS_CCCSR_COMP_EN);
}

/**
  * @brief  Disable the I/O compensation cell
  * @rmtoll SBS_CCCSR COMP_EN     LL_SBS_DisableIOCompCell
  * @retval None
  */
__STATIC_INLINE void LL_SBS_DisableIOCompCell(void)
{
  CLEAR_BIT(SBS->CCCSR, SBS_CCCSR_COMP_EN);
}

/**
  * @brief  Check if the I/O compensation cell is enabled
  * @rmtoll SBS_CCCSR COMP_EN     LL_SBS_IsEnabledIOCompCell
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SBS_IsEnabledIOCompCell(void)
{
  return ((READ_BIT(SBS->CCCSR, SBS_CCCSR_COMP_EN) != 0UL) ? 1UL : 0UL);
}

/**
  * @brief  Get the XSPI2 PMOS compensation
  * @rmtoll SBS_CCVALR XSPI2_PSRC     LL_SBS_GetXSPI2PmosComp
  * @retval Returned value is the slew-rate compensation for XSPI2 PMOS transistors (value between 0 and 0xF)
  */
__STATIC_INLINE uint32_t LL_SBS_GetXSPI2PmosComp(void)
{
  return (uint32_t)((READ_BIT(SBS->CCVALR, SBS_CCVALR_XSPI2_PSRC)) >> SBS_CCVALR_XSPI2_PSRC_Pos);
}

/**
  * @brief  Get the XSPI2 NMOS compensation
  * @rmtoll SBS_CCVALR XSPI2_NSRC     LL_SBS_GetXSPI2NmosComp
  * @retval Returned value is the slew-rate compensation for XSPI2 NMOS transistors (value between 0 and 0xF)
  */
__STATIC_INLINE uint32_t LL_SBS_GetXSPI2NmosComp(void)
{
  return (uint32_t)((READ_BIT(SBS->CCVALR, SBS_CCVALR_XSPI2_NSRC)) >> SBS_CCVALR_XSPI2_NSRC_Pos);
}

/**
  * @brief  Get the XSPI1 PMOS compensation
  * @rmtoll SBS_CCVALR XSPI1_PSRC     LL_SBS_GetXSPI1PmosComp
  * @retval Returned value is the slew-rate compensation for XSPI1 PMOS transistors (value between 0 and 0xF)
  */
__STATIC_INLINE uint32_t LL_SBS_GetXSPI1PmosComp(void)
{
  return (uint32_t)((READ_BIT(SBS->CCVALR, SBS_CCVALR_XSPI1_PSRC)) >> SBS_CCVALR_XSPI1_PSRC_Pos);
}

/**
  * @brief  Get the XSPI NMOS compensation
  * @rmtoll SBS_CCVALR XSPI1_NSRC     LL_SBS_GetXSPI1NmosComp
  * @retval Returned value is the slew-rate compensation for XSPI1 NMOS transistors (value between 0 and 0xF)
  */
__STATIC_INLINE uint32_t LL_SBS_GetXSPI1NmosComp(void)
{
  return (uint32_t)((READ_BIT(SBS->CCVALR, SBS_CCVALR_XSPI1_NSRC)) >> SBS_CCVALR_XSPI1_NSRC_Pos);
}

/**
  * @brief  Get the I/O PMOS compensation
  * @rmtoll SBS_CCVALR PSRC     LL_SBS_GetIOPmosComp
  * @retval Returned value is the slew-rate compensation for I/O PMOS transistors (value between 0 and 0xF)
  */
__STATIC_INLINE uint32_t LL_SBS_GetIOPmosComp(void)
{
  return (uint32_t)((READ_BIT(SBS->CCVALR, SBS_CCVALR_PSRC)) >> SBS_CCVALR_PSRC_Pos);
}

/**
  * @brief  Get the I/O NMOS compensation
  * @rmtoll SBS_CCVALR NSRC     LL_SBS_GetIONmosComp
  * @retval Returned value is the slew-rate compensation for I/O NMOS transistors (value between 0 and 0xF)
  */
__STATIC_INLINE uint32_t LL_SBS_GetIONmosComp(void)
{
  return (uint32_t)(READ_BIT(SBS->CCVALR, SBS_CCVALR_NSRC));
}

/**
  * @brief  Set the XSPI2 software PMOS compensation
  * @rmtoll SBS_CCSWVALR XSPI2_SW_PSRC     LL_SBS_SetXSPI2SwPmosComp
  * @param  Compensation This parameter can have a value between 0 and 0xF
  * @retval None
  */
__STATIC_INLINE void LL_SBS_SetXSPI2SwPmosComp(uint32_t Compensation)
{
  MODIFY_REG(SBS->CCSWVALR, SBS_CCSWVALR_XSPI2_SW_PSRC, (Compensation << SBS_CCSWVALR_XSPI2_SW_PSRC_Pos));
}

/**
  * @brief  Get the XSPI2 PMOS compensation
  * @rmtoll SBS_CCSWVALR XSPI2_SW_PSRC     LL_SBS_GetXSPI2SwPmosComp
  * @retval Returned value is the slew-rate compensation for XSPI2 PMOS transistors (value between 0 and 0xF)
  */
__STATIC_INLINE uint32_t LL_SBS_GetXSPI2SwPmosComp(void)
{
  return (uint32_t)((READ_BIT(SBS->CCSWVALR, SBS_CCSWVALR_XSPI2_SW_PSRC)) >> SBS_CCSWVALR_XSPI2_SW_PSRC_Pos);
}

/**
  * @brief  Set the XSPI2 software NMOS compensation
  * @rmtoll SBS_CCSWVALR XSPI2_SW_NSRC     LL_SBS_SetXSPI2SwNmosComp
  * @param  Compensation This parameter can have a value between 0 and 0xF
  * @retval None
  */
__STATIC_INLINE void LL_SBS_SetXSPI2SwNmosComp(uint32_t Compensation)
{
  MODIFY_REG(SBS->CCSWVALR, SBS_CCSWVALR_XSPI2_SW_NSRC, (Compensation << SBS_CCSWVALR_XSPI2_SW_NSRC_Pos));
}

/**
  * @brief  Get the XSPI2 software NMOS compensation
  * @rmtoll SBS_CCSWVALR XSPI2_SW_NSRC     LL_SBS_GetXSPI2SwNmosComp
  * @retval Returned value is the slew-rate compensation for XSPI2 NMOS transistors (value between 0 and 0xF)
  */
__STATIC_INLINE uint32_t LL_SBS_GetXSPI2SwNmosComp(void)
{
  return (uint32_t)((READ_BIT(SBS->CCSWVALR, SBS_CCSWVALR_XSPI2_SW_NSRC)) >> SBS_CCSWVALR_XSPI2_SW_NSRC_Pos);
}

/**
  * @brief  Set the XSPI1 software PMOS compensation
  * @rmtoll SBS_CCSWVALR XSPI2_SW_PSRC     LL_SBS_SetXSPI1SwPmosComp
  * @param  Compensation This parameter can have a value between 0 and 0xF
  * @retval None
  */
__STATIC_INLINE void LL_SBS_SetXSPI1SwPmosComp(uint32_t Compensation)
{
  MODIFY_REG(SBS->CCSWVALR, SBS_CCSWVALR_XSPI1_SW_PSRC, (Compensation << SBS_CCSWVALR_XSPI1_SW_PSRC_Pos));
}

/**
  * @brief  Get the XSPI1 PMOS compensation
  * @rmtoll SBS_CCSWVALR XSPI1_SW_PSRC     LL_SBS_GetXSPI1SwPmosComp
  * @retval Returned value is the slew-rate compensation for XSPI1 PMOS transistors (value between 0 and 0xF)
  */
__STATIC_INLINE uint32_t LL_SBS_GetXSPI1SwPmosComp(void)
{
  return (uint32_t)((READ_BIT(SBS->CCSWVALR, SBS_CCSWVALR_XSPI1_SW_PSRC)) >> SBS_CCSWVALR_XSPI1_SW_PSRC_Pos);
}

/**
  * @brief  Set the XSPI1 software NMOS compensation
  * @rmtoll SBS_CCSWVALR XSPI1_SW_NSRC     LL_SBS_SetXSPI1SwNmosComp
  * @param  Compensation This parameter can have a value between 0 and 0xF
  * @retval None
  */
__STATIC_INLINE void LL_SBS_SetXSPI1SwNmosComp(uint32_t Compensation)
{
  MODIFY_REG(SBS->CCSWVALR, SBS_CCSWVALR_XSPI1_SW_NSRC, (Compensation << SBS_CCSWVALR_XSPI1_SW_NSRC_Pos));
}

/**
  * @brief  Get the XSPI1 software NMOS compensation
  * @rmtoll SBS_CCSWVALR XSPI1_SW_NSRC     LL_SBS_GetXSPI1SwNmosComp
  * @retval Returned value is the slew-rate compensation for XSPI1 NMOS transistors (value between 0 and 0xF)
  */
__STATIC_INLINE uint32_t LL_SBS_GetXSPI1SwNmosComp(void)
{
  return (uint32_t)((READ_BIT(SBS->CCSWVALR, SBS_CCSWVALR_XSPI1_SW_NSRC)) >> SBS_CCSWVALR_XSPI1_SW_NSRC_Pos);
}

/**
  * @brief  Set the I/O software PMOS compensation
  * @rmtoll SBS_CCSWVALR SW_PSRC     LL_SBS_SetIOSwPmosComp
  * @param  Compensation This parameter can have a value between 0 and 0xF
  * @retval None
  */
__STATIC_INLINE void LL_SBS_SetIOSwPmosComp(uint32_t Compensation)
{
  MODIFY_REG(SBS->CCSWVALR, SBS_CCSWVALR_SW_PSRC, (Compensation << SBS_CCSWVALR_SW_PSRC_Pos));
}

/**
  * @brief  Get the I/O PMOS compensation
  * @rmtoll SBS_CCSWVALR SW_PSRC     LL_SBS_GetIOSwPmosComp
  * @retval Returned value is the slew-rate compensation for I/O PMOS transistors (value between 0 and 0xF)
  */
__STATIC_INLINE uint32_t LL_SBS_GetIOSwPmosComp(void)
{
  return (uint32_t)((READ_BIT(SBS->CCSWVALR, SBS_CCSWVALR_SW_PSRC)) >> SBS_CCSWVALR_SW_PSRC_Pos);
}

/**
  * @brief  Set the I/O software NMOS compensation
  * @rmtoll SBS_CCSWVALR SW_NSRC     LL_SBS_SetIOSwNmosComp
  * @param  Compensation This parameter can have a value between 0 and 0xF
  * @retval None
  */
__STATIC_INLINE void LL_SBS_SetIOSwNmosComp(uint32_t Compensation)
{
  MODIFY_REG(SBS->CCSWVALR, SBS_CCSWVALR_SW_NSRC, (Compensation << SBS_CCSWVALR_SW_NSRC_Pos));
}

/**
  * @brief  Get the I/O software NMOS compensation
  * @rmtoll SBS_CCSWVALR SW_NSRC     LL_SBS_GetIOSwNmosComp
  * @retval Returned value is the slew-rate compensation for I/O NMOS transistors (value between 0 and 0xF)
  */
__STATIC_INLINE uint32_t LL_SBS_GetIOSwNmosComp(void)
{
  return (uint32_t)((READ_BIT(SBS->CCSWVALR, SBS_CCSWVALR_SW_NSRC)) >> SBS_CCSWVALR_SW_NSRC_Pos);
}

/**
  * @brief  Set connections to TIM1/15/16/17 Break inputs
  * @rmtoll SBS_BKLOCKR PVD_BL          LL_SBS_SetTIMBreakInputs\n
  *         SBS_BKLOCKR FLASHECC_BL     LL_SBS_SetTIMBreakInputs\n
  *         SBS_BKLOCKR CM7LCKUP_BL     LL_SBS_SetTIMBreakInputs\n
  *         SBS_BKLOCKR BKRAMECC_BL     LL_SBS_SetTIMBreakInputs\n
  *         SBS_BKLOCKR DTCMECC_BL      LL_SBS_SetTIMBreakInputs\n
  *         SBS_BKLOCKR ITCMECC_BL      LL_SBS_SetTIMBreakInputs\n
  *         SBS_BKLOCKR ARAM3ECC_BL     LL_SBS_SetTIMBreakInputs\n
  *         SBS_BKLOCKR ARAM1ECC_BL     LL_SBS_SetTIMBreakInputs
  * @param  Break This parameter can be a combination of the following values:
  *         @arg @ref LL_SBS_TIMBREAK_PVD
  *         @arg @ref LL_SBS_TIMBREAK_FLASHECC
  *         @arg @ref LL_SBS_TIMBREAK_CM7LCKUP
  *         @arg @ref LL_SBS_TIMBREAK_BKRAMECC
  *         @arg @ref LL_SBS_TIMBREAK_DTCMECC
  *         @arg @ref LL_SBS_TIMBREAK_ITCMECC
  *         @arg @ref LL_SBS_TIMBREAK_ARAM3ECC
  *         @arg @ref LL_SBS_TIMBREAK_ARAM1ECC
  * @retval None
  */
__STATIC_INLINE void LL_SBS_SetTIMBreakInputs(uint32_t Break)
{
  MODIFY_REG(SBS->BKLOCKR,
             (SBS_BKLOCKR_PVD_BL | SBS_BKLOCKR_FLASHECC_BL | SBS_BKLOCKR_CM7LCKUP_BL | SBS_BKLOCKR_BKRAMECC_BL | \
              SBS_BKLOCKR_DTCMECC_BL | SBS_BKLOCKR_ITCMECC_BL | SBS_BKLOCKR_ARAM3ECC_BL | SBS_BKLOCKR_ARAM1ECC_BL)
             , Break);
}

/**
  * @brief  Get connections to TIM1/15/16/17 Break inputs
  * @rmtoll SBS_BKLOCKR CLL           LL_SBS_GetTIMBreakInputs\n
  *         SBS_BKLOCKR SPL           LL_SBS_GetTIMBreakInputs\n
  *         SBS_BKLOCKR PVDL          LL_SBS_GetTIMBreakInputs\n
  *         SBS_BKLOCKR ECCL          LL_SBS_GetTIMBreakInputs
  * @retval Returned value can be can be a combination of the following values:
  *         @arg @ref LL_SBS_TIMBREAK_PVD
  *         @arg @ref LL_SBS_TIMBREAK_FLASHECC
  *         @arg @ref LL_SBS_TIMBREAK_CM7LCKUP
  *         @arg @ref LL_SBS_TIMBREAK_BKRAMECC
  *         @arg @ref LL_SBS_TIMBREAK_DTCMECC
  *         @arg @ref LL_SBS_TIMBREAK_ITCMECC
  *         @arg @ref LL_SBS_TIMBREAK_ARAM3ECC
  *         @arg @ref LL_SBS_TIMBREAK_ARAM1ECC
  */
__STATIC_INLINE uint32_t LL_SBS_GetTIMBreakInputs(void)
{
  return (uint32_t)(READ_BIT(SBS->BKLOCKR,
                             (SBS_BKLOCKR_PVD_BL | SBS_BKLOCKR_FLASHECC_BL | SBS_BKLOCKR_CM7LCKUP_BL | \
                              SBS_BKLOCKR_BKRAMECC_BL | SBS_BKLOCKR_DTCMECC_BL | SBS_BKLOCKR_ITCMECC_BL | \
                              SBS_BKLOCKR_ARAM3ECC_BL | SBS_BKLOCKR_ARAM1ECC_BL)));
}

/**
  * @brief  Configure source input for the EXTI external interrupt.
  * @rmtoll SBS_EXTICR1 EXTI0         LL_SBS_SetEXTISource\n
  *         SBS_EXTICR1 EXTI1         LL_SBS_SetEXTISource\n
  *         SBS_EXTICR1 EXTI2         LL_SBS_SetEXTISource\n
  *         SBS_EXTICR1 EXTI3         LL_SBS_SetEXTISource\n
  *         SBS_EXTICR2 EXTI4         LL_SBS_SetEXTISource\n
  *         SBS_EXTICR2 EXTI5         LL_SBS_SetEXTISource\n
  *         SBS_EXTICR2 EXTI6         LL_SBS_SetEXTISource\n
  *         SBS_EXTICR2 EXTI7         LL_SBS_SetEXTISource\n
  *         SBS_EXTICR3 EXTI8         LL_SBS_SetEXTISource\n
  *         SBS_EXTICR3 EXTI9         LL_SBS_SetEXTISource\n
  *         SBS_EXTICR3 EXTI10        LL_SBS_SetEXTISource\n
  *         SBS_EXTICR3 EXTI11        LL_SBS_SetEXTISource\n
  *         SBS_EXTICR4 EXTI12        LL_SBS_SetEXTISource\n
  *         SBS_EXTICR4 EXTI13        LL_SBS_SetEXTISource\n
  *         SBS_EXTICR4 EXTI14        LL_SBS_SetEXTISource\n
  *         SBS_EXTICR4 EXTI15        LL_SBS_SetEXTISource
  * @param  Port This parameter can be one of the following values:
  *         @arg @ref LL_SBS_EXTI_PORTA
  *         @arg @ref LL_SBS_EXTI_PORTB
  *         @arg @ref LL_SBS_EXTI_PORTC
  *         @arg @ref LL_SBS_EXTI_PORTD
  *         @arg @ref LL_SBS_EXTI_PORTE
  *         @arg @ref LL_SBS_EXTI_PORTF
  *         @arg @ref LL_SBS_EXTI_PORTG
  *         @arg @ref LL_SBS_EXTI_PORTH
  *         @arg @ref LL_SBS_EXTI_PORTM
  *         @arg @ref LL_SBS_EXTI_PORTN
  *         @arg @ref LL_SBS_EXTI_PORTO
  *         @arg @ref LL_SBS_EXTI_PORTP
  *
  *         (*) value not defined in all devices
  * @param  Line This parameter can be one of the following values:
  *         @arg @ref LL_SBS_EXTI_LINE0
  *         @arg @ref LL_SBS_EXTI_LINE1
  *         @arg @ref LL_SBS_EXTI_LINE2
  *         @arg @ref LL_SBS_EXTI_LINE3
  *         @arg @ref LL_SBS_EXTI_LINE4
  *         @arg @ref LL_SBS_EXTI_LINE5
  *         @arg @ref LL_SBS_EXTI_LINE6
  *         @arg @ref LL_SBS_EXTI_LINE7
  *         @arg @ref LL_SBS_EXTI_LINE8
  *         @arg @ref LL_SBS_EXTI_LINE9
  *         @arg @ref LL_SBS_EXTI_LINE10
  *         @arg @ref LL_SBS_EXTI_LINE11
  *         @arg @ref LL_SBS_EXTI_LINE12
  *         @arg @ref LL_SBS_EXTI_LINE13
  *         @arg @ref LL_SBS_EXTI_LINE14
  *         @arg @ref LL_SBS_EXTI_LINE15
  * @retval None
  */
__STATIC_INLINE void LL_SBS_SetEXTISource(uint32_t Port, uint32_t Line)
{
  MODIFY_REG(SBS->EXTICR[Line & 0x03U],
             SBS_EXTICR1_PC_EXTI0 << (Line >> LL_SBS_REGISTER_PINPOS_SHFT),
             Port << (Line >> LL_SBS_REGISTER_PINPOS_SHFT));
}

/**
  * @brief  Get the configured defined for specific EXTI Line
  * @rmtoll SBS_EXTICR1 EXTI0         LL_SBS_GetEXTISource\n
  *         SBS_EXTICR1 EXTI1         LL_SBS_GetEXTISource\n
  *         SBS_EXTICR1 EXTI2         LL_SBS_GetEXTISource\n
  *         SBS_EXTICR1 EXTI3         LL_SBS_GetEXTISource\n
  *         SBS_EXTICR2 EXTI4         LL_SBS_GetEXTISource\n
  *         SBS_EXTICR2 EXTI5         LL_SBS_GetEXTISource\n
  *         SBS_EXTICR2 EXTI6         LL_SBS_GetEXTISource\n
  *         SBS_EXTICR2 EXTI7         LL_SBS_GetEXTISource\n
  *         SBS_EXTICR3 EXTI8         LL_SBS_GetEXTISource\n
  *         SBS_EXTICR3 EXTI9         LL_SBS_GetEXTISource\n
  *         SBS_EXTICR3 EXTI10        LL_SBS_GetEXTISource\n
  *         SBS_EXTICR3 EXTI11        LL_SBS_GetEXTISource\n
  *         SBS_EXTICR4 EXTI12        LL_SBS_GetEXTISource\n
  *         SBS_EXTICR4 EXTI13        LL_SBS_GetEXTISource\n
  *         SBS_EXTICR4 EXTI14        LL_SBS_GetEXTISource\n
  *         SBS_EXTICR4 EXTI15        LL_SBS_GetEXTISource
  * @param  Line This parameter can be one of the following values:
  *         @arg @ref LL_SBS_EXTI_LINE0
  *         @arg @ref LL_SBS_EXTI_LINE1
  *         @arg @ref LL_SBS_EXTI_LINE2
  *         @arg @ref LL_SBS_EXTI_LINE3
  *         @arg @ref LL_SBS_EXTI_LINE4
  *         @arg @ref LL_SBS_EXTI_LINE5
  *         @arg @ref LL_SBS_EXTI_LINE6
  *         @arg @ref LL_SBS_EXTI_LINE7
  *         @arg @ref LL_SBS_EXTI_LINE8
  *         @arg @ref LL_SBS_EXTI_LINE9
  *         @arg @ref LL_SBS_EXTI_LINE10
  *         @arg @ref LL_SBS_EXTI_LINE11
  *         @arg @ref LL_SBS_EXTI_LINE12
  *         @arg @ref LL_SBS_EXTI_LINE13
  *         @arg @ref LL_SBS_EXTI_LINE14
  *         @arg @ref LL_SBS_EXTI_LINE15
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SBS_EXTI_PORTA
  *         @arg @ref LL_SBS_EXTI_PORTB
  *         @arg @ref LL_SBS_EXTI_PORTC
  *         @arg @ref LL_SBS_EXTI_PORTD
  *         @arg @ref LL_SBS_EXTI_PORTE
  *         @arg @ref LL_SBS_EXTI_PORTF
  *         @arg @ref LL_SBS_EXTI_PORTG
  *         @arg @ref LL_SBS_EXTI_PORTH
  *         @arg @ref LL_SBS_EXTI_PORTM
  *         @arg @ref LL_SBS_EXTI_PORTN
  *         @arg @ref LL_SBS_EXTI_PORTO
  *         @arg @ref LL_SBS_EXTI_PORTP
  */
__STATIC_INLINE uint32_t LL_SBS_GetEXTISource(uint32_t Line)
{
  return (uint32_t)(READ_BIT(SBS->EXTICR[Line & 0x03U],
                             (SBS_EXTICR1_PC_EXTI0 << (Line >> LL_SBS_REGISTER_PINPOS_SHFT))) >> (Line >> LL_SBS_REGISTER_PINPOS_SHFT));
}

/**
  * @}
  */

/** @defgroup SYSTEM_LL_EF_DBGMCU DBGMCU
  * @{
  */

/**
  * @brief  Return the device identifier
  * @rmtoll DBGMCU_IDCODE DEV_ID        LL_DBGMCU_GetDeviceID
  * @retval Values between Min_Data=0x00 and Max_Data=0xFFFF (ex: device ID is 0x6415)
  */
__STATIC_INLINE uint32_t LL_DBGMCU_GetDeviceID(void)
{
  return (uint32_t)(READ_BIT(DBGMCU->IDCODE, DBGMCU_IDCODE_DEV_ID));
}

/**
  * @brief  Return the device revision identifier
  * @note This field indicates the revision of the device.
  * @rmtoll DBGMCU_IDCODE REV_ID        LL_DBGMCU_GetRevisionID
  * @retval Values between Min_Data=0x00 and Max_Data=0xFFFF
  */
__STATIC_INLINE uint32_t LL_DBGMCU_GetRevisionID(void)
{
  return (uint32_t)(READ_BIT(DBGMCU->IDCODE, DBGMCU_IDCODE_REV_ID) >> DBGMCU_IDCODE_REV_ID_Pos);
}

/**
  * @brief  Enable the Debug Module during sleep mode
  * @rmtoll DBGMCU_CR    DBG_SLEEP      LL_DBGMCU_EnableDBGSleepMode
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_EnableDBGSleepMode(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_SLEEP);
}

/**
  * @brief  Disable the Debug Module during sleep mode
  * @rmtoll DBGMCU_CR    DBG_SLEEP      LL_DBGMCU_DisableDBGSleepMode
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_DisableDBGSleepMode(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_DBG_SLEEP);
}

/**
  * @brief  Indicate if the Debug Module during sleep mode is enabled
  * @rmtoll DBGMCU_CR    DBG_SLEEP      LL_DBGMCU_IsEnabledDBGSleepMode
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DBGMCU_IsEnabledDBGSleepMode(void)
{
  return ((READ_BIT(DBGMCU->CR, DBGMCU_CR_DBG_SLEEP) == (DBGMCU_CR_DBG_SLEEP)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the Debug Module during STOP mode
  * @rmtoll DBGMCU_CR    DBG_STOP      LL_DBGMCU_EnableDBGStopMode
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_EnableDBGStopMode(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STOP);
}

/**
  * @brief  Disable the Debug Module during STOP mode
  * @rmtoll DBGMCU_CR    DBG_STOP      LL_DBGMCU_DisableDBGStopMode
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_DisableDBGStopMode(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STOP);
}

/**
  * @brief  Indicate if the Debug Module during STOP mode is enabled
  * @rmtoll DBGMCU_CR    DBG_STOP      LL_DBGMCU_IsEnabledDBGStopMode
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DBGMCU_IsEnabledDBGStopMode(void)
{
  return ((READ_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STOP) == (DBGMCU_CR_DBG_STOP)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the Debug Module during STANDBY mode
  * @rmtoll DBGMCU_CR    DBG_STANDBY   LL_DBGMCU_EnableDBGStandbyMode
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_EnableDBGStandbyMode(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STANDBY);
}

/**
  * @brief  Disable the Debug Module during STANDBY mode
  * @rmtoll DBGMCU_CR    DBG_STANDBY   LL_DBGMCU_DisableDBGStandbyMode
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_DisableDBGStandbyMode(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STANDBY);
}

/**
  * @brief  Indicate if the Debug Module during STANDBY mode is enabled
  * @rmtoll DBGMCU_CR    DBG_STANDBY   LL_DBGMCU_IsEnabledDBGStandbyMode
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DBGMCU_IsEnabledDBGStandbyMode(void)
{
  return ((READ_BIT(DBGMCU->CR, DBGMCU_CR_DBG_STANDBY) == (DBGMCU_CR_DBG_STANDBY)) ? 1UL : 0UL);
}

/**
  * @brief  Configure the debug credentials reset type
  * @rmtoll DBGMCU_CR DCRT     LL_DBGMCU_SetDbgCredentialResetType
  * @param  Type This parameter can be one of the following values:
  *         @arg @ref LL_DBGMCU_DCRT_SYSTEM
  *         @arg @ref LL_DBGMCU_DCRT_POWER
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_SetDbgCredentialResetType(uint32_t Type)
{
  MODIFY_REG(DBGMCU->CR, DBGMCU_CR_DCRT, Type);
}

/**
  * @brief  Get the selected debug credentials reset type
  * @rmtoll DBGMCU_CR DCRT     LL_DBGMCU_GetDbgCredentialResetType
  * @retval Returned value is the debug credentials reset type:
  *         @arg @ref LL_DBGMCU_DCRT_SYSTEM
  *         @arg @ref LL_DBGMCU_DCRT_POWER
  */
__STATIC_INLINE uint32_t LL_DBGMCU_GetDbgCredentialResetType(void)
{
  return (uint32_t)(READ_BIT(DBGMCU->CR, DBGMCU_CR_DCRT));
}

/**
  * @brief  Enable the clock for Trace port
  * @rmtoll DBGMCU_CR    TRACECLKEN      LL_DBGMCU_EnableTraceClock
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_EnableTraceClock(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_TRACECLKEN);
}

/**
  * @brief  Disable the clock for Trace port
  * @rmtoll DBGMCU_CR    TRACECLKEN      LL_DBGMCU_DisableTraceClock
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_DisableTraceClock(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_TRACECLKEN);
}

/**
  * @brief  Indicate if the clock for Trace port is enabled
  * @rmtoll DBGMCU_CR    TRACE_EN      LL_DBGMCU_IsEnabledTraceClock
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DBGMCU_IsEnabledTraceClock(void)
{
  return ((READ_BIT(DBGMCU->CR, DBGMCU_CR_TRACECLKEN) == (DBGMCU_CR_TRACECLKEN)) ? 1UL : 0UL);
}

/**
  * @brief  Enable the clock for debug port
  * @rmtoll DBGMCU_CR    D1DBGCKEN      LL_DBGMCU_EnableDebugClock
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_EnableDebugClock(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_DBGCKEN);
}

/**
  * @brief  Disable the clock for debug port
  * @rmtoll DBGMCU_CR    D1DBGCKEN      LL_DBGMCU_DisableDebugClock
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_DisableDebugClock(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_DBGCKEN);
}

/**
  * @brief  Indicate if the clock for debug port is enabled
  * @rmtoll DBGMCU_CR    D1DBGCKEN      LL_DBGMCU_IsEnabledDebugClock
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DBGMCU_IsEnabledDebugClock(void)
{
  return ((READ_BIT(DBGMCU->CR, DBGMCU_CR_DBGCKEN) != 0UL) ? 1UL : 0UL);
}

/**
  * @brief  Enable the external trigger output
  * @rmtoll DBGMCU_CR    TRGOEN      LL_DBGMCU_EnableTriggerOutput
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_EnableTriggerOutput(void)
{
  SET_BIT(DBGMCU->CR, DBGMCU_CR_TRGOEN);
}

/**
  * @brief  Disable the external trigger output
  * @rmtoll DBGMCU_CR    TRGOEN      LL_DBGMCU_DisableTriggerOutput
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_DisableTriggerOutput(void)
{
  CLEAR_BIT(DBGMCU->CR, DBGMCU_CR_TRGOEN);
}

/**
  * @brief  Indicate if the external trigger output is enabled
  * @rmtoll DBGMCU_CR    TRGOEN      LL_DBGMCU_IsEnabledTriggerOutput
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_DBGMCU_IsEnabledTriggerOutput(void)
{
  return ((READ_BIT(DBGMCU->CR, DBGMCU_CR_TRGOEN) != 0UL) ? 1UL : 0UL);
}

