RT-Thread/rt-thread/bsp/stm32/libraries/STM32H7RSxx_HAL/STM32H7RSxx_HAL_Driver/Inc/stm32h7rsxx_ll_system.h
/**
  * @brief  Freeze APB1 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_APB1FZR DBG_xxxx_STOP  LL_DBGMCU_APB1_GRP1_FreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM2_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM3_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM4_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM5_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM6_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM7_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM12_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM13_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM14_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_LPTIM1_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_WWDG_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C1_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C2_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C3_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB1_GRP1_FreezePeriph(uint32_t Periphs)
{
  SET_BIT(DBGMCU->APB1FZR, Periphs);
}

/**
  * @brief  UnFreeze APB1 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_APB1FZR DBG_xxxx_STOP  LL_DBGMCU_APB1_GRP1_UnFreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM2_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM3_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM4_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM5_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM6_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM7_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM12_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM13_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_TIM14_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_LPTIM1_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_WWDG_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C1_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C2_STOP
  *         @arg @ref LL_DBGMCU_APB1_GRP1_I2C3_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB1_GRP1_UnFreezePeriph(uint32_t Periphs)
{
  CLEAR_BIT(DBGMCU->APB1FZR, Periphs);
}

/**
  * @brief  Freeze APB4 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_APB4FZR DBG_xxxx_STOP  LL_DBGMCU_APB4_GRP1_FreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB4_GRP1_LPTIM2_STOP
  *         @arg @ref LL_DBGMCU_APB4_GRP1_LPTIM3_STOP
  *         @arg @ref LL_DBGMCU_APB4_GRP1_LPTIM4_STOP
  *         @arg @ref LL_DBGMCU_APB4_GRP1_LPTIM5_STOP
  *         @arg @ref LL_DBGMCU_APB4_GRP1_IWDG_STOP
  *         @arg @ref LL_DBGMCU_APB4_GRP1_RTC_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB4_GRP1_FreezePeriph(uint32_t Periphs)
{
  SET_BIT(DBGMCU->APB4FZR, Periphs);
}

/**
  * @brief  UnFreeze APB4 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_APB4FZR DBG_xxxx_STOP  LL_DBGMCU_APB4_GRP1_UnFreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB4_GRP1_LPTIM2_STOP
  *         @arg @ref LL_DBGMCU_APB4_GRP1_LPTIM3_STOP
  *         @arg @ref LL_DBGMCU_APB4_GRP1_LPTIM4_STOP
  *         @arg @ref LL_DBGMCU_APB4_GRP1_LPTIM5_STOP
  *         @arg @ref LL_DBGMCU_APB4_GRP1_IWDG_STOP
  *         @arg @ref LL_DBGMCU_APB4_GRP1_RTC_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB4_GRP1_UnFreezePeriph(uint32_t Periphs)
{
  CLEAR_BIT(DBGMCU->APB4FZR, Periphs);
}

/**
  * @brief  freeze APB2 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_APB2FZR DBG_xxxx_STOP  LL_DBGMCU_APB2_GRP1_FreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM1_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM9_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM15_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM16_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM17_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB2_GRP1_FreezePeriph(uint32_t Periphs)
{
  SET_BIT(DBGMCU->APB2FZR, Periphs);
}

/**
  * @brief  Unfreeze APB2 peripherals
  * @rmtoll DBGMCU_APB2FZR DBG_TIMx_STOP  LL_DBGMCU_APB2_GRP1_UnFreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM1_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM9_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM15_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM16_STOP
  *         @arg @ref LL_DBGMCU_APB2_GRP1_TIM17_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_APB2_GRP1_UnFreezePeriph(uint32_t Periphs)
{
  CLEAR_BIT(DBGMCU->APB2FZR, Periphs);
}

/**
  * @brief  freeze AHB5 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_AHB5FZR DBG_xxxx_STOP  LL_DBGMCU_AHB5_GRP1_FreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA0_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA1_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA2_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA3_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA4_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA5_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA6_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA7_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA8_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA9_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA10_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA11_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA12_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA13_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA14_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA15_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_AHB5_GRP1_FreezePeriph(uint32_t Periphs)
{
  SET_BIT(DBGMCU->AHB5FZR, Periphs);
}

/**
  * @brief  Unfreeze AHB5 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_AHB5FZR DBG_xxxx_STOP  LL_DBGMCU_AHB5_GRP1_UnFreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA0_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA1_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA2_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA3_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA4_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA5_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA6_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA7_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA8_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA9_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA10_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA11_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA12_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA13_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA14_STOP
  *         @arg @ref LL_DBGMCU_AHB5_GRP1_HPDMA15_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_AHB5_GRP1_UnFreezePeriph(uint32_t Periphs)
{
  CLEAR_BIT(DBGMCU->AHB5FZR, Periphs);
}

/**
  * @brief  freeze AHB1 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_AHB1FZR DBG_xxxx_STOP  LL_DBGMCU_AHB1_GRP1_FreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA0_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA1_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA2_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA3_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA4_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA5_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA6_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA7_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA8_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA9_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA10_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA11_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA12_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA13_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA14_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA15_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_AHB1_GRP1_FreezePeriph(uint32_t Periphs)
{
  SET_BIT(DBGMCU->AHB1FZR, Periphs);
}

/**
  * @brief  Unfreeze AHB1 peripherals (group1 peripherals)
  * @rmtoll DBGMCU_AHB1FZR DBG_xxxx_STOP  LL_DBGMCU_AHB1_GRP1_UnFreezePeriph
  * @param  Periphs This parameter can be a combination of the following values:
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA0_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA1_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA2_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA3_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA4_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA5_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA6_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA7_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA8_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA9_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA10_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA11_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA12_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA13_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA14_STOP
  *         @arg @ref LL_DBGMCU_AHB1_GRP1_GPDMA15_STOP
  * @retval None
  */
__STATIC_INLINE void LL_DBGMCU_AHB1_GRP1_UnFreezePeriph(uint32_t Periphs)
{
  CLEAR_BIT(DBGMCU->AHB1FZR, Periphs);
}

/**
  * @}
  */

#if defined(VREFBUF)
/** @defgroup SYSTEM_LL_EF_VREFBUF VREFBUF
  * @{
  */

/**
  * @brief  Enable Internal voltage reference
  * @rmtoll VREFBUF_CSR  ENVR          LL_VREFBUF_Enable
  * @retval None
  */
__STATIC_INLINE void LL_VREFBUF_Enable(void)
{
  SET_BIT(VREFBUF->CSR, VREFBUF_CSR_ENVR);
}

/**
  * @brief  Disable Internal voltage reference
  * @rmtoll VREFBUF_CSR  ENVR          LL_VREFBUF_Disable
  * @retval None
  */
__STATIC_INLINE void LL_VREFBUF_Disable(void)
{
  CLEAR_BIT(VREFBUF->CSR, VREFBUF_CSR_ENVR);
}

/**
  * @brief  Enable high impedance (VREF+pin is high impedance)
  * @rmtoll VREFBUF_CSR  HIZ           LL_VREFBUF_EnableHIZ
  * @retval None
  */
__STATIC_INLINE void LL_VREFBUF_EnableHIZ(void)
{
  SET_BIT(VREFBUF->CSR, VREFBUF_CSR_HIZ);
}

/**
  * @brief  Disable high impedance (VREF+pin is internally connected to the voltage reference buffer output)
  * @rmtoll VREFBUF_CSR  HIZ           LL_VREFBUF_DisableHIZ
  * @retval None
  */
__STATIC_INLINE void LL_VREFBUF_DisableHIZ(void)
{
  CLEAR_BIT(VREFBUF->CSR, VREFBUF_CSR_HIZ);
}

/**
  * @brief  Set the Voltage reference scale
  * @rmtoll VREFBUF_CSR  VRS           LL_VREFBUF_SetVoltageScaling
  * @param  Scale This parameter can be one of the following values:
  *         @arg @ref LL_VREFBUF_VOLTAGE_SCALE0
  *         @arg @ref LL_VREFBUF_VOLTAGE_SCALE1
  *         @arg @ref LL_VREFBUF_VOLTAGE_SCALE2
  *         @arg @ref LL_VREFBUF_VOLTAGE_SCALE3
  * @retval None
  */
__STATIC_INLINE void LL_VREFBUF_SetVoltageScaling(uint32_t Scale)
{
  MODIFY_REG(VREFBUF->CSR, VREFBUF_CSR_VRS, Scale);
}

/**
  * @brief  Get the Voltage reference scale
  * @rmtoll VREFBUF_CSR  VRS           LL_VREFBUF_GetVoltageScaling
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_VREFBUF_VOLTAGE_SCALE0
  *         @arg @ref LL_VREFBUF_VOLTAGE_SCALE1
  *         @arg @ref LL_VREFBUF_VOLTAGE_SCALE2
  *         @arg @ref LL_VREFBUF_VOLTAGE_SCALE3
  */
__STATIC_INLINE uint32_t LL_VREFBUF_GetVoltageScaling(void)
{
  return (uint32_t)(READ_BIT(VREFBUF->CSR, VREFBUF_CSR_VRS));
}

/**
  * @brief  Check if Voltage reference buffer is ready
  * @rmtoll VREFBUF_CSR  VRR           LL_VREFBUF_IsVREFReady
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_VREFBUF_IsVREFReady(void)
{
  return ((READ_BIT(VREFBUF->CSR, VREFBUF_CSR_VRR) == VREFBUF_CSR_VRR) ? 1UL : 0UL);
}

/**
  * @brief  Get the trimming code for VREFBUF calibration
  * @rmtoll VREFBUF_CCR  TRIM          LL_VREFBUF_GetTrimming
  * @retval Between 0 and 0x3F
  */
__STATIC_INLINE uint32_t LL_VREFBUF_GetTrimming(void)
{
  return (uint32_t)(READ_BIT(VREFBUF->CCR, VREFBUF_CCR_TRIM));
}

/**
  * @brief  Set the trimming code for VREFBUF calibration (Tune the internal reference buffer voltage)
  * @rmtoll VREFBUF_CCR  TRIM          LL_VREFBUF_SetTrimming
  * @param  Value Between 0 and 0x3F
  * @retval None
  */
__STATIC_INLINE void LL_VREFBUF_SetTrimming(uint32_t Value)
{
  WRITE_REG(VREFBUF->CCR, Value);
}

/**
  * @}
  */
#endif /* VREFBUF */

/** @defgroup SYSTEM_LL_EF_FLASH FLASH
  * @{
  */

/**
  * @brief  Set FLASH Latency
  * @rmtoll FLASH_ACR    LATENCY       LL_FLASH_SetLatency
  * @param  Latency This parameter can be one of the following values:
  *         @arg @ref LL_FLASH_LATENCY_0
  *         @arg @ref LL_FLASH_LATENCY_1
  *         @arg @ref LL_FLASH_LATENCY_2
  *         @arg @ref LL_FLASH_LATENCY_3
  *         @arg @ref LL_FLASH_LATENCY_4
  *         @arg @ref LL_FLASH_LATENCY_5
  *         @arg @ref LL_FLASH_LATENCY_6
  *         @arg @ref LL_FLASH_LATENCY_7
  *         @arg @ref LL_FLASH_LATENCY_8
  *         @arg @ref LL_FLASH_LATENCY_9
  *         @arg @ref LL_FLASH_LATENCY_10
  *         @arg @ref LL_FLASH_LATENCY_11
  *         @arg @ref LL_FLASH_LATENCY_12
  *         @arg @ref LL_FLASH_LATENCY_13
  *         @arg @ref LL_FLASH_LATENCY_14
  *         @arg @ref LL_FLASH_LATENCY_15
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_SetLatency(uint32_t Latency)
{
  MODIFY_REG(FLASH->ACR, FLASH_ACR_LATENCY, Latency);
}

/**
  * @brief  Get FLASH Latency
  * @rmtoll FLASH_ACR    LATENCY       LL_FLASH_GetLatency
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_FLASH_LATENCY_0
  *         @arg @ref LL_FLASH_LATENCY_1
  *         @arg @ref LL_FLASH_LATENCY_2
  *         @arg @ref LL_FLASH_LATENCY_3
  *         @arg @ref LL_FLASH_LATENCY_4
  *         @arg @ref LL_FLASH_LATENCY_5
  *         @arg @ref LL_FLASH_LATENCY_6
  *         @arg @ref LL_FLASH_LATENCY_7
  *         @arg @ref LL_FLASH_LATENCY_8
  *         @arg @ref LL_FLASH_LATENCY_9
  *         @arg @ref LL_FLASH_LATENCY_10
  *         @arg @ref LL_FLASH_LATENCY_11
  *         @arg @ref LL_FLASH_LATENCY_12
  *         @arg @ref LL_FLASH_LATENCY_13
  *         @arg @ref LL_FLASH_LATENCY_14
  *         @arg @ref LL_FLASH_LATENCY_15
  */
__STATIC_INLINE uint32_t LL_FLASH_GetLatency(void)
{
  return (uint32_t)(READ_BIT(FLASH->ACR, FLASH_ACR_LATENCY));
}

/**
  * @brief  Unlock the Flash
  * @rmtoll FLASH_KEYR    CUKEY       LL_FLASH_Unlock
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_Unlock(void)
{
  /* Unlock Flash */
  FLASH->KEYR = 0x45670123U;
  FLASH->KEYR = 0xCDEF89ABU;
}

/**
  * @brief  Lock the Flash
  * @rmtoll FLASH_CR    LOCK       LL_FLASH_Lock
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_Lock(void)
{
  /* Lock Flash */
  SET_BIT(FLASH->CR, FLASH_CR_LOCK);
}

/**
  * @brief  Check if Flash is locked
  * @rmtoll FLASH_CR    LOCK       LL_FLASH_IsLocked
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsLocked(void)
{
  return ((READ_BIT(FLASH->CR, FLASH_CR_LOCK) == FLASH_CR_LOCK) ? 1UL : 0UL);
}

/**
  * @brief  Unlock the Option Bytes update
  * @rmtoll FLASH_OPTKEYR    OCUKEY       LL_FLASH_OptionBytes_Unlock
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_OptionBytes_Unlock(void)
{
  /* Unlock Option Bytes */
  FLASH->OPTKEYR = 0x08192A3BU;
  FLASH->OPTKEYR = 0x4C5D6E7FU;
}

/**
  * @brief  Lock the Option Bytes update
  * @rmtoll FLASH_OPTCR    OPTLOCK       LL_FLASH_OptionBytes_Lock
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_OptionBytes_Lock(void)
{
  /* Lock option bytes */
  SET_BIT(FLASH->OPTCR, FLASH_OPTCR_OPTLOCK);
}

/**
  * @brief  Check if Option Bytes update is locked
  * @rmtoll FLASH_OPTCR    OPTLOCK       LL_FLASH_OptionBytes_IsLocked
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_FLASH_OptionBytes_IsLocked(void)
{
  return ((READ_BIT(FLASH->OPTCR, FLASH_OPTCR_OPTLOCK) == FLASH_OPTCR_OPTLOCK) ? 1UL : 0UL);
}

/**
  * @brief  Enable Option Bytes programming
  * @rmtoll FLASH_OPTCR    PG_OPT       LL_FLASH_OptionBytes_EnableProg
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_OptionBytes_EnableProg(void)
{
  /* Set PG_OPT Bit */
  SET_BIT(FLASH->OPTCR, FLASH_OPTCR_PG_OPT);
}

/**
  * @brief  Disable Option Bytes programming
  * @rmtoll FLASH_OPTCR    PG_OPT       LL_FLASH_OptionBytes_DisableProg
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_OptionBytes_DisableProg(void)
{
  /* Clear PG_OPT Bit */
  CLEAR_BIT(FLASH->OPTCR, FLASH_OPTCR_PG_OPT);
}

/**
  * @brief  Check if Option Bytes programming is enabled
  * @rmtoll FLASH_OPTCR    PG_OPT       LL_FLASH_OptionBytes_IsEnabledProg
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_FLASH_OptionBytes_IsEnabledProg(void)
{
  return ((READ_BIT(FLASH->OPTCR, FLASH_OPTCR_PG_OPT) == FLASH_OPTCR_PG_OPT) ? 1UL : 0UL);
}

/**
  * @brief  Check if operation pending
  * @rmtoll FLASH_SR    QW       LL_FLASH_IsPendingOperation
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_FLASH_IsPendingOperation(void)
{
  return ((READ_BIT(FLASH->SR, FLASH_SR_QW) == FLASH_SR_QW) ? 1UL : 0UL);
}

/**
  * @brief  Enable the I2C in Flash User Option bytes
  * @rmtoll FLASH_OBW2SR    I2C_NI3C       LL_FLASH_OptionBytes_EnableI2C
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_OptionBytes_EnableI2C(void)
{
  /* Set I2C_N3C Bit */
  SET_BIT(FLASH->OBW2SRP, FLASH_OBW2SRP_I2C_NI3C);
}

/**
  * @brief  Enable the I3C in Flash User Option bytes
  * @rmtoll FLASH_OBW2SR    I2C_NI3C       LL_FLASH_OptionBytes_EnableI3C
  * @retval None
  */
__STATIC_INLINE void LL_FLASH_OptionBytes_EnableI3C(void)
{
  /* Clear I2C_N3C Bit */
  CLEAR_BIT(FLASH->OBW2SRP, FLASH_OBW2SRP_I2C_NI3C);
}

/**
  * @brief  Check if I2C is enabled in Flash User Option Bytes
  * @rmtoll FLASH_OBW2SR    I2C_NI3C       LL_FLASH_OptionBytes_IsI2CEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_FLASH_OptionBytes_IsI2CEnabled(void)
{
  return ((READ_BIT(FLASH->OBW2SR, FLASH_OBW2SR_I2C_NI3C) == FLASH_OBW2SR_I2C_NI3C) ? 1UL : 0UL);
}

/**
  * @brief  Check if I3C is enabled in Flash User Option Bytes
  * @rmtoll FLASH_OBW2SR    I2C_NI3C       LL_FLASH_OptionBytes_IsI3CEnabled
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_FLASH_OptionBytes_IsI3CEnabled(void)
{
  return ((READ_BIT(FLASH->OBW2SR, FLASH_OBW2SR_I2C_NI3C) == 0U) ? 1UL : 0UL);
}

/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */

#endif /* defined (FLASH) || defined (SBS) || defined (DBGMCU) || defined (VREFBUF) */

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* STM32H7RSxx_LL_SYSTEM_H */
